#pragma once

// Rocket League (1.31) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Constants
//---------------------------------------------------------------------------

#define CONST_InMatchmakingID                                    -2
#define CONST_MAX_CONTROLLER_IDS                                 4
#define CONST_NumFriendsPerRequest                               100
#define CONST_XpTitleID                                          'XP'
#define CONST_ClosedReason_DuplicateLogin                        "DuplicateLogin"
#define CONST_LocalPlayersBroadcastDelay                         0.1f
#define CONST_QueueMax                                           100
#define CONST_MatchLog_X_HttpContentType                         "plain/text"
#define CONST_MaxPing                                            1.0f

//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum ProjectX._Types_X.EJoinMatchType
enum class EJoinMatchType : uint8_t
{
	JMT_Public                     = 0,
	JMT_Private                    = 1,
	JMT_LanHost                    = 2,
	JMT_LanGuest                   = 3,
	JMT_MAX                        = 4
};


// Enum ProjectX._Types_X.EAuthResult
enum class EAuthResult : uint8_t
{
	AuthResult_OK                  = 0,
	AuthResult_Unauthorized        = 1,
	AuthResult_MAX                 = 2
};


// Enum ProjectX._Types_X.EWebRequestAuthorization
enum class EWebRequestAuthorization : uint8_t
{
	WRA_Offline                    = 0,
	WRA_Authorizing                = 1,
	WRA_Authorized                 = 2,
	WRA_Banned                     = 3,
	WRA_MAX                        = 4
};


// Enum ProjectX._Types_X.EBanType
enum class EBanType : uint8_t
{
	BanType_None                   = 0,
	BanType_Auth                   = 1,
	BanType_Chat                   = 2,
	BanType_Parental               = 3,
	BanType_Club                   = 4,
	BanType_Trade                  = 5,
	BanType_MAX                    = 6
};


// Enum ProjectX._Types_X.EConsoleQualityMode
enum class EConsoleQualityMode : uint8_t
{
	ConsoleQualityMode_Performance = 0,
	ConsoleQualityMode_Quality     = 1,
	ConsoleQualityMode_MAX         = 2
};


// Enum ProjectX._Types_X.EPlayerAuthState
enum class EPlayerAuthState : uint8_t
{
	EPlayerAuthState_None          = 0,
	EPlayerAuthState_NewUserFlow   = 1,
	EPlayerAuthState_HighlightReel = 2,
	EPlayerAuthState_SetName       = 3,
	EPlayerAuthState_RequestingInitialLoadout = 4,
	EPlayerAuthState_InitialLoadoutFailed = 5,
	EPlayerAuthState_CarSelect     = 6,
	EPlayerAuthState_CarSelected   = 7,
	EPlayerAuthState_MAX           = 8
};


// Enum ProjectX._Types_X.EReservationStatus
enum class EReservationStatus : uint8_t
{
	ReservationStatus_None         = 0,
	ReservationStatus_Reserved     = 1,
	ReservationStatus_Joining      = 2,
	ReservationStatus_InGame       = 3,
	ReservationStatus_MAX          = 4
};


// Enum ProjectX._Types_X.EDatabaseEnvironment
enum class EDatabaseEnvironment : uint8_t
{
	DBE_DevLocal                   = 0,
	DBE_Dev                        = 1,
	DBE_Test                       = 2,
	DBE_Production                 = 3,
	DBE_MAX                        = 4
};


// Enum ProjectX._Types_X.EAxisSign
enum class EAxisSign : uint8_t
{
	AxisSign_None                  = 0,
	AxisSign_Positive              = 1,
	AxisSign_Negative              = 2,
	AxisSign_MAX                   = 3
};


// Enum ProjectX._Types_X.EButtonPressType
enum class EButtonPressType : uint8_t
{
	BPT_Normal                     = 0,
	BPT_Tap                        = 1,
	BPT_Hold                       = 2,
	BPT_DoubleTap                  = 3,
	BPT_Toggle                     = 4,
	BPT_MAX                        = 5
};


// Enum ProjectX._Types_X.ERemappable
enum class ERemappable : uint8_t
{
	Remappable_All                 = 0,
	Remappable_Key                 = 1,
	Remappable_Axis                = 2,
	Remappable_KeyTriggerAxis      = 3,
	Remappable_None                = 4,
	Remappable_MAX                 = 5
};


// Enum ProjectX._Types_X.EUINavigationMode
enum class EUINavigationMode : uint8_t
{
	UINavigationMode_Keyboard      = 0,
	UINavigationMode_Gamepad       = 1,
	UINavigationMode_Cursor        = 2,
	UINavigationMode_MAX           = 3
};


// Enum ProjectX._Types_X.EPartyMatchmakingRestriction
enum class EPartyMatchmakingRestriction : uint8_t
{
	PMR_NotOriginalAppOwner        = 0,
	PMR_PendingLicenseAgreement    = 1,
	PMR_InMainMenu                 = 2,
	PMR_NotLoggedInPsyNet          = 3,
	PMR_MAX                        = 4
};


// Enum ProjectX._Types_X.EBlogTileType
enum class EBlogTileType : uint8_t
{
	EBlogTileType_Carousel         = 0,
	EBlogTileType_RLCS             = 1,
	EBlogTileType_Community        = 2,
	EBlogTileType_MAX              = 3
};


// Enum ProjectX._Types_X.EOnlinePlayerPermission
enum class EOnlinePlayerPermission : uint8_t
{
	OPP_PrivateMatchAdmin          = 0,
	OPP_SuperPrivateMatchAdmin     = 1,
	OPP_MAX                        = 2
};


// Enum ProjectX._Types_X.EOnlinePlayerRole
enum class EOnlinePlayerRole : uint8_t
{
	OPR_PrivateMatchAdmin          = 0,
	OPR_SuperPrivateMatchAdmin     = 1,
	OPR_MAX                        = 2
};


// Enum ProjectX._Types_X.EPsyNetTransportType
enum class EPsyNetTransportType : uint8_t
{
	PsyNetTransport_HTTP           = 0,
	PsyNetTransport_WebSocket      = 1,
	PsyNetTransport_MAX            = 2
};


// Enum ProjectX.AnimNodeSeries_X.EAnimNodeSeriesChild
enum class EAnimNodeSeriesChild : uint8_t
{
	AnimNodeSeries_Idle            = 0,
	AnimNodeSeries_Intro           = 1,
	AnimNodeSeries_Loop            = 2,
	AnimNodeSeries_Outro           = 3,
	AnimNodeSeries_MAX             = 4
};


// Enum ProjectX.BugReport_X.EFileTruncateType
enum class EFileTruncateType : uint8_t
{
	FileTruncate_None              = 0,
	FileTruncate_KeepStart         = 1,
	FileTruncate_KeepEnd           = 2,
	FileTruncate_MAX               = 3
};


// Enum ProjectX.FXActor_X.EFXComponentTarget
enum class EFXComponentTarget : uint8_t
{
	FXComponentTarget_All          = 0,
	FXComponentTarget_Local        = 1,
	FXComponentTarget_NonLocal     = 2,
	FXComponentTarget_MAX          = 3
};


// Enum ProjectX.FXActor_X.EFXComponentState
enum class EFXComponentState : uint8_t
{
	FXComponentState_Detached      = 0,
	FXComponentState_Attached      = 1,
	FXComponentState_PendingDetach = 2,
	FXComponentState_MAX           = 3
};


// Enum ProjectX.FXActor_X.EAttachActorLocationUnlockFlags
enum class EAttachActorLocationUnlockFlags : uint8_t
{
	EAALUF_None                    = 0,
	EAALUF_X                       = 1,
	EAALUF_Y                       = 2,
	EAALUF_Z                       = 3,
	EAALUF_MAX                     = 4
};


// Enum ProjectX.GFxDataCallback_X.EDataCallbackType
enum class EDataCallbackType : uint8_t
{
	DataCallbackType_All           = 0,
	DataCallbackType_Table         = 1,
	DataCallbackType_Row           = 2,
	DataCallbackType_Value         = 3,
	DataCallbackType_MAX           = 4
};


// Enum ProjectX.MaterialEffect_X.EMaterialEffectStage
enum class EMaterialEffectStage : uint8_t
{
	EFFECT_INACTIVE                = 0,
	EFFECT_FADE_IN                 = 1,
	EFFECT_ACTIVE                  = 2,
	EFFECT_FADE_OUT                = 3,
	EFFECT_MAX                     = 4
};


// Enum ProjectX.OnlineGameDLC_X.DLCOwnershipState
enum class EDLCOwnershipState : uint8_t
{
	DLCOwnershipState_Unknown      = 0,
	DLCOwnershipState_Owned        = 1,
	DLCOwnershipState_NotOwned     = 2,
	DLCOwnershipState_Error        = 3,
	DLCOwnershipState_MAX          = 4
};


// Enum ProjectX.OnlineGameParty_X.PartyProcessingStatus
enum class EPartyProcessingStatus : uint8_t
{
	PPS_None                       = 0,
	PPS_Create                     = 1,
	PPS_Join                       = 2,
	PPS_MAX                        = 3
};


// Enum ProjectX.WordFilterTypes_X.EWordFilterUsage
enum class EWordFilterUsage : uint8_t
{
	WordFilterUsage_PlayerName     = 0,
	WordFilterUsage_TrainingName   = 1,
	WordFilterUsage_LanServerName  = 2,
	WordFilterUsage_CustomTeamName = 3,
	WordFilterUsage_TourName       = 4,
	WordFilterUsage_TourTeamName   = 5,
	WordFilterUsage_ClubName       = 6,
	WordFilterUsage_ClubTag        = 7,
	WordFilterUsage_ClubMotD       = 8,
	WordFilterUsage_ClubTagPlayerName = 9,
	WordFilterUsage_MatchChat      = 10,
	WordFilterUsage_PartyChat      = 11,
	WordFilterUsage_MAX            = 12
};


// Enum ProjectX.ReservationsPasswordMessage_X.EPasswordFailureReason
enum class EPasswordFailureReason : uint8_t
{
	PFR_Empty                      = 0,
	PFR_Mismatch                   = 1,
	PFR_MAX                        = 2
};


// Enum ProjectX.RPC_X.ERPCPriority
enum class ERPCPriority : uint8_t
{
	RPC_Low                        = 0,
	RPC_Medium                     = 1,
	RPC_High                       = 2,
	RPC_MAX                        = 3
};


// Enum ProjectX.ShakeComponent_X.EShakeReceiver
enum class EShakeReceiver : uint8_t
{
	ShakeReceiver_All              = 0,
	ShakeReceiver_Local            = 1,
	ShakeReceiver_NonLocal         = 2,
	ShakeReceiver_MAX              = 3
};


// Enum ProjectX.TcpConnection.EWebSocketState
enum class EWebSocketState : uint8_t
{
	WebSocketState_NotRequired     = 0,
	WebSocketState_NeedsHandshake  = 1,
	WebSocketState_Connected       = 2,
	WebSocketState_MAX             = 3
};


// Enum ProjectX.TcpConnection.ETcpConnectionState
enum class ETcpConnectionState : uint8_t
{
	TcpConnectionState_Invalid     = 0,
	TcpConnectionState_Connecting  = 1,
	TcpConnectionState_Connected   = 2,
	TcpConnectionState_Disconnected = 3,
	TcpConnectionState_MAX         = 4
};


// Enum ProjectX.WebRequest_X.EWebRequestState
enum class EWebRequestState : uint8_t
{
	WebRequestState_PendingSend    = 0,
	WebRequestState_PendingResponse = 1,
	WebRequestState_Success        = 2,
	WebRequestState_Error          = 3,
	WebRequestState_MAX            = 4
};


// Enum ProjectX.FakeData_X.FakeDataEnum
enum class EFakeDataEnum : uint8_t
{
	FakeData                       = 0,
	FakeData01                     = 1,
	FakeData02                     = 2,
	FakeData_Count                 = 3,
	FakeData_MAX                   = 4
};


// Enum ProjectX.ClanforgeReservation_X.EReserveState
enum class EReserveState : uint8_t
{
	ReserveState_Unitialized       = 0,
	ReserveState_Unreserved        = 1,
	ReserveState_Reserved          = 2,
	ReserveState_MAX               = 3
};


// Enum ProjectX.PerCon_X.EPerConStatus
enum class EPerConStatus : uint8_t
{
	PerConStatus_Disabled          = 0,
	PerConStatus_Enabled           = 1,
	PerConStatus_MAX               = 2
};


// Enum ProjectX.DynamicValue_X.EDynamicValueModType
enum class EDynamicValueModType : uint8_t
{
	ModType_Add                    = 0,
	ModType_Multiply               = 1,
	ModType_MultiplyAdd            = 2,
	ModType_Set                    = 3,
	ModType_MAX                    = 4
};


// Enum ProjectX.EncodeObject_X.EObjectEncoding
enum class EObjectEncoding : uint8_t
{
	OPSE_UObject                   = 0,
	OPSE_Json                      = 1,
	OPSE_MAX                       = 2
};


// Enum ProjectX.ClubUtil_X.EClubColorChange
enum class EClubColorChange : uint8_t
{
	ClubColorChange_None           = 0,
	ClubColorChange_SwapTeams      = 1,
	ClubColorChange_SwapPrimaryAccent0 = 2,
	ClubColorChange_SwapPrimaryAccent1 = 3,
	ClubColorChange_SwapPrimaryAccent = 4,
	ClubColorChange_WhiteVsBlack   = 5,
	ClubColorChange_Gray1          = 6,
	ClubColorChange_MAX            = 7
};


// Enum ProjectX._NetworkNextTypes_X.ENetworkNextState
enum class ENetworkNextState : uint8_t
{
	NetworkNextState_Disabled      = 0,
	NetworkNextState_ForceDirect   = 1,
	NetworkNextState_UseDirect     = 2,
	NetworkNextState_UseRoute      = 3,
	NetworkNextState_MAX           = 4
};


// Enum ProjectX.OnlinePlayerRegionRestrictions_X.ERegionRestriction
enum class ERegionRestriction : uint8_t
{
	RegionRestriction_Unknown      = 0,
	RegionRestriction_KeyCrate     = 1,
	RegionRestriction_Trade        = 2,
	RegionRestriction_KeyRocketPassTier = 3,
	RegionRestriction_MAX          = 4
};


// Enum ProjectX.RegionPing_X.RegionPingResult
enum class ERegionPingResult : uint8_t
{
	PingResult_NotUsable           = 0,
	PingResult_UsingCache          = 1,
	PingResult_UsingSuccessfulPing = 2,
	PingResult_MAX                 = 3
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct ProjectX._Types_X.CheckReservationResponse
// 0x0078
struct FCheckReservationResponse
{
	struct FString                                     IP;                                                       // 0x0000(0x0010) (NeedCtorLink)
	struct FString                                     ServerName;                                               // 0x0010(0x0010) (NeedCtorLink)
	int                                                Playlist;                                                 // 0x0020(0x0004)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
	struct FString                                     Region;                                                   // 0x0028(0x0010) (NeedCtorLink)
	struct FString                                     Host;                                                     // 0x0038(0x0010) (NeedCtorLink)
	int                                                Port;                                                     // 0x0048(0x0004)
	unsigned char                                      UnknownData01[0x4];                                       // 0x004C(0x0004) MISSED OFFSET
	struct FString                                     ReservationID;                                            // 0x0050(0x0010) (NeedCtorLink)
	struct FString                                     DSConnectToken;                                           // 0x0060(0x0010) (NeedCtorLink)
	class UUdpEncryptionKeys*                          Keys;                                                     // 0x0070(0x0008)
};

// ScriptStruct ProjectX._Types_X.ServerReservationData
// 0x0070
struct FServerReservationData
{
	struct FString                                     serverId;                                                 // 0x0000(0x0010) (NeedCtorLink)
	struct FString                                     BeaconURL;                                                // 0x0010(0x0010) (NeedCtorLink)
	struct FString                                     ServerName;                                               // 0x0020(0x0010) (NeedCtorLink)
	int                                                Playlist;                                                 // 0x0030(0x0004)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
	struct FString                                     Region;                                                   // 0x0038(0x0010) (NeedCtorLink)
	struct FString                                     ReservationID;                                            // 0x0048(0x0010) (NeedCtorLink)
	struct FString                                     DSRToken;                                                 // 0x0058(0x0010) (NeedCtorLink)
	class UUdpEncryptionKeys*                          Keys;                                                     // 0x0068(0x0008)
};

// ScriptStruct ProjectX._Types_X.IntVector3
// 0x000C
struct FIntVector3
{
	int                                                X;                                                        // 0x0000(0x0004) (Edit)
	int                                                Y;                                                        // 0x0004(0x0004) (Edit)
	int                                                Z;                                                        // 0x0008(0x0004) (Edit)
};

// ScriptStruct ProjectX.ExplosionHitHandler_X.ContactInformation
// 0x001C
struct FContactInformation
{
	struct FVector                                     ContactLocation;                                          // 0x0000(0x000C) (Transient)
	struct FVector                                     ContactVelocity;                                          // 0x000C(0x000C) (Transient)
	float                                              ContactTime;                                              // 0x0018(0x0004) (Transient)
};

// ScriptStruct ProjectX.FXActor_X.FXActorEventCheck
// 0x000C
struct FFXActorEventCheck
{
	class UFXActorEvent_X*                             Event;                                                    // 0x0000(0x0008)
	unsigned long                                      bHasTicked : 1;                                           // 0x0008(0x0004)
};

// ScriptStruct ProjectX.FXActor_X.FXEventSubscription
// 0x0038
struct FFXEventSubscription
{
	class UFXActorEvent_X*                             Event;                                                    // 0x0000(0x0008)
	struct FScriptDelegate                             OnPushed;                                                 // 0x0008(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             OnPopped;                                                 // 0x0020(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0020(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
};

// ScriptStruct ProjectX.FXActor_X.AttachToParameterWithUnlockAxes
// 0x0009
struct FAttachToParameterWithUnlockAxes
{
	struct FName                                       Parameter;                                                // 0x0000(0x0008) (Edit)
	TEnumAsByte<EAttachActorLocationUnlockFlags>       IgnoredAxis;                                              // 0x0008(0x0001) (Edit)
};

// ScriptStruct ProjectX.FXActor_X.FXAttachment
// 0x010C
struct FFXAttachment
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (Edit)
	struct FName                                       SkeletalMeshAttachName;                                   // 0x0008(0x0008) (Edit)
	struct FName                                       SocketOrBoneName;                                         // 0x0010(0x0008) (Edit)
	struct FName                                       AttachToParameter;                                        // 0x0018(0x0008) (Edit, EditConst)
	float                                              AttachDelay;                                              // 0x0020(0x0004) (Edit)
	float                                              DetachDelay;                                              // 0x0024(0x0004) (Edit)
	float                                              LifeTime;                                                 // 0x0028(0x0004) (Edit)
	TEnumAsByte<EFXComponentTarget>                    Target;                                                   // 0x002C(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
	class UActorComponent*                             Component;                                                // 0x0030(0x0008) (Edit, ExportObject, Component, EditInline)
	TArray<class UFXActorEvent_X*>                     AttachAny;                                                // 0x0038(0x0010) (Edit, NeedCtorLink)
	TArray<class UFXActorEvent_X*>                     DetachAny;                                                // 0x0048(0x0010) (Edit, NeedCtorLink)
	TArray<class UFXActorEvent_X*>                     AttachAll;                                                // 0x0058(0x0010) (Edit, NeedCtorLink)
	TArray<class URuntimeParameterBase_X*>             RuntimeParameters;                                        // 0x0068(0x0010) (Edit, NeedCtorLink, EditInline)
	TArray<class UFXAttachmentTraitBase_X*>            Traits;                                                   // 0x0078(0x0010) (Edit, NeedCtorLink, EditInline)
	struct FAttachToParameterWithUnlockAxes            AttachToParameterActor;                                   // 0x0088(0x000C) (Edit)
	unsigned long                                      bCreateDuplicates : 1;                                    // 0x0094(0x0004) (Const)
	unsigned long                                      bWantsAttachment : 1;                                     // 0x0094(0x0004) (Transient)
	unsigned long                                      bInitializedTraits : 1;                                   // 0x0094(0x0004) (Transient)
	unsigned long                                      bExistingComponent : 1;                                   // 0x0094(0x0004)
	unsigned long                                      bExistingAttachment : 1;                                  // 0x0094(0x0004)
	float                                              AttachedTime;                                             // 0x0098(0x0004) (Transient)
	TEnumAsByte<EFXComponentState>                     State;                                                    // 0x009C(0x0001) (Transient)
	unsigned char                                      UnknownData01[0x3];                                       // 0x009D(0x0003) MISSED OFFSET
	float                                              WantsAttachmentChangeTime;                                // 0x00A0(0x0004) (Transient)
	unsigned char                                      UnknownData02[0x4];                                       // 0x00A4(0x0004) MISSED OFFSET
	class USkeletalMeshComponent*                      AttachedToMesh;                                           // 0x00A8(0x0008) (ExportObject, Transient, Component, EditInline)
	struct FMatrix                                     RelativeTransform;                                        // 0x00B0(0x0040) (Transient)
	int                                                BoneIndex;                                                // 0x00F0(0x0004) (Transient)
	unsigned char                                      UnknownData03[0x4];                                       // 0x00F4(0x0004) MISSED OFFSET
	class AActor*                                      AttachToActor;                                            // 0x00F8(0x0008) (Transient)
	struct FVector                                     OffsetToAttachActor;                                      // 0x0100(0x000C) (Transient)
};

// ScriptStruct ProjectX.ShakeComponent_X.ShakeReceiver
// 0x000C
struct FShakeReceiver
{
	class APlayerController*                           Player;                                                   // 0x0000(0x0008)
	float                                              Scale;                                                    // 0x0008(0x0004)
};

// ScriptStruct ProjectX.AnimateParametersComponent_X.AnimatedParam
// 0x0008
struct FAnimatedParam
{
	struct FName                                       ParamName;                                                // 0x0000(0x0008) (Edit)
};

// ScriptStruct ProjectX.AnimateParametersComponent_X.AnimatedFloatParam
// 0x0018 (0x0020 - 0x0008)
struct FAnimatedFloatParam : public FAnimatedParam
{
	struct FInterpCurveFloat                           ValueOverTime;                                            // 0x0008(0x0018) (Edit, NeedCtorLink)
};

// ScriptStruct ProjectX.AnimateParametersComponent_X.AnimatedVectorParam
// 0x0018 (0x0020 - 0x0008)
struct FAnimatedVectorParam : public FAnimatedParam
{
	struct FInterpCurveVector                          ValueOverTime;                                            // 0x0008(0x0018) (Edit, NeedCtorLink)
};

// ScriptStruct ProjectX.AnimateParametersComponent_X.AnimatedLinearColorParam
// 0x0018 (0x0020 - 0x0008)
struct FAnimatedLinearColorParam : public FAnimatedParam
{
	struct FInterpCurveLinearColor                     ValueOverTime;                                            // 0x0008(0x0018) (Edit, NeedCtorLink)
};

// ScriptStruct ProjectX.ReservationBeacon_X.BeaconMessageHandler
// 0x0018
struct FBeaconMessageHandler
{
	class UClass*                                      MessageClass;                                             // 0x0000(0x0008)
	TArray<struct FScriptDelegate>                     Delegates;                                                // 0x0008(0x0010) (NeedCtorLink)
};

// ScriptStruct ProjectX.BugReport_X.BugReportSubmitterData
// 0x0030
struct FBugReportSubmitterData
{
	class APlayerController*                           Submitter;                                                // 0x0000(0x0008)
	struct FString                                     Name;                                                     // 0x0008(0x0010) (NeedCtorLink)
	struct FVector                                     Location;                                                 // 0x0018(0x000C)
	struct FRotator                                    Rotation;                                                 // 0x0024(0x000C)
};

// ScriptStruct ProjectX.BugReport_X.BugReportSystemData
// 0x0034
struct FBugReportSystemData
{
	struct FString                                     ComputerName;                                             // 0x0000(0x0010) (NeedCtorLink)
	struct FString                                     GameName;                                                 // 0x0010(0x0010) (NeedCtorLink)
	struct FString                                     NetMode;                                                  // 0x0020(0x0010) (NeedCtorLink)
	unsigned long                                      bClient : 1;                                              // 0x0030(0x0004)
};

// ScriptStruct ProjectX.BugReport_X.BugReportPathData
// 0x0040
struct FBugReportPathData
{
	struct FString                                     OutputPath;                                               // 0x0000(0x0010) (NeedCtorLink)
	struct FString                                     LogName;                                                  // 0x0010(0x0010) (NeedCtorLink)
	struct FString                                     LogPath;                                                  // 0x0020(0x0010) (NeedCtorLink)
	struct FString                                     ScreenShotPath;                                           // 0x0030(0x0010) (NeedCtorLink)
};

// ScriptStruct ProjectX.BugReport_X.BugReportDescriptionData
// 0x0050
struct FBugReportDescriptionData
{
	struct FString                                     Title;                                                    // 0x0000(0x0010) (NeedCtorLink)
	struct FString                                     ShortTitle;                                               // 0x0010(0x0010) (NeedCtorLink)
	struct FString                                     MetaTitle;                                                // 0x0020(0x0010) (NeedCtorLink)
	struct FString                                     Description;                                              // 0x0030(0x0010) (NeedCtorLink)
	struct FString                                     Email;                                                    // 0x0040(0x0010) (NeedCtorLink)
};

// ScriptStruct ProjectX.BugReport_X.FileUploadData
// 0x0039
struct FFileUploadData
{
	class UBugReport_X*                                BugReport;                                                // 0x0000(0x0008)
	struct FString                                     BugID;                                                    // 0x0008(0x0010) (NeedCtorLink)
	struct FString                                     Folder;                                                   // 0x0018(0x0010) (NeedCtorLink)
	struct FString                                     FilePath;                                                 // 0x0028(0x0010) (NeedCtorLink)
	TEnumAsByte<EFileTruncateType>                     TruncateType;                                             // 0x0038(0x0001)
};

// ScriptStruct ProjectX.Camera_X.CameraOrientation
// 0x002C
struct FCameraOrientation
{
	struct FVector                                     Focus;                                                    // 0x0000(0x000C)
	struct FRotator                                    Rotation;                                                 // 0x000C(0x000C)
	float                                              Distance;                                                 // 0x0018(0x0004)
	float                                              FOV;                                                      // 0x001C(0x0004)
	struct FVector                                     CalculatedLocation;                                       // 0x0020(0x000C)
};

// ScriptStruct ProjectX.Camera_X.CameraKnockBase
// 0x0010
struct FCameraKnockBase
{
	float                                              BlendInTime;                                              // 0x0000(0x0004) (Edit)
	float                                              BlendOutTime;                                             // 0x0004(0x0004) (Edit)
	float                                              Falloff;                                                  // 0x0008(0x0004) (Edit)
	float                                              Time;                                                     // 0x000C(0x0004) (Transient)
};

// ScriptStruct ProjectX.Camera_X.LocationCameraKnock
// 0x000C (0x001C - 0x0010)
struct FLocationCameraKnock : public FCameraKnockBase
{
	struct FVector                                     Amount;                                                   // 0x0010(0x000C) (Edit)
};

// ScriptStruct ProjectX.Camera_X.RotationCameraKnock
// 0x000C (0x001C - 0x0010)
struct FRotationCameraKnock : public FCameraKnockBase
{
	struct FRotator                                    Amount;                                                   // 0x0010(0x000C) (Edit)
};

// ScriptStruct ProjectX.Camera_X.VectorInterpRate
// 0x0018
struct FVectorInterpRate
{
	float                                              MaxDistance;                                              // 0x0000(0x0004)
	float                                              InterpRate;                                               // 0x0004(0x0004)
	float                                              ForwardScale;                                             // 0x0008(0x0004)
	float                                              BackwardScale;                                            // 0x000C(0x0004)
	float                                              SideScale;                                                // 0x0010(0x0004)
	float                                              UpDownScale;                                              // 0x0014(0x0004)
};

// ScriptStruct ProjectX._Types_X.PlayerSeasonRewardProgress
// 0x0040
struct FPlayerSeasonRewardProgress
{
	struct FUniqueNetId                                PlayerID;                                                 // 0x0000(0x0038)
	int                                                Level;                                                    // 0x0038(0x0004)
	int                                                Wins;                                                     // 0x003C(0x0004)
};

// ScriptStruct ProjectX._Types_X.ClubColorSet
// 0x0008
struct FClubColorSet
{
	unsigned char                                      TeamColorID;                                              // 0x0000(0x0001)
	unsigned char                                      CustomColorID;                                            // 0x0001(0x0001)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	unsigned long                                      bTeamColorSet : 1;                                        // 0x0004(0x0004)
	unsigned long                                      bCustomColorSet : 1;                                      // 0x0004(0x0004)
};

// ScriptStruct ProjectX._Types_X.CustomMatchTeamSettings
// 0x001C
struct FCustomMatchTeamSettings
{
	struct FString                                     Name;                                                     // 0x0000(0x0010) (NeedCtorLink)
	struct FClubColorSet                               Colors;                                                   // 0x0010(0x0008)
	int                                                GameScore;                                                // 0x0018(0x0004)
};

// ScriptStruct ProjectX._Types_X.CustomMatchSettings
// 0x008C
struct U_Types_X_FCustomMatchSettings
{
	struct FString                                     GameTags;                                                 // 0x0000(0x0010) (NeedCtorLink)
	struct FName                                       MapName;                                                  // 0x0010(0x0008)
	unsigned char                                      GameMode;                                                 // 0x0018(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0019(0x0003) MISSED OFFSET
	int                                                MaxPlayerCount;                                           // 0x001C(0x0004)
	struct FString                                     ServerName;                                               // 0x0020(0x0010) (NeedCtorLink)
	struct FString                                     Password;                                                 // 0x0030(0x0010) (NeedCtorLink)
	unsigned long                                      bPublic : 1;                                              // 0x0040(0x0004)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
	struct FCustomMatchTeamSettings                    TeamSettings[0x2];                                        // 0x0048(0x0020) (NeedCtorLink)
	unsigned long                                      bClubServer : 1;                                          // 0x0088(0x0004)
};

// ScriptStruct ProjectX.ColorPalette_X.ColorPosition
// 0x0008
struct FColorPosition
{
	int                                                Row;                                                      // 0x0000(0x0004)
	int                                                Column;                                                   // 0x0004(0x0004)
};

// ScriptStruct ProjectX._Types_X.PlayerBinding
// 0x002C
struct FPlayerBinding
{
	struct FName                                       Action;                                                   // 0x0000(0x0008) (DataBinding)
	struct FName                                       Key;                                                      // 0x0008(0x0008) (DataBinding)
	TEnumAsByte<EAxisSign>                             AxisSign;                                                 // 0x0010(0x0001) (DataBinding)
	TEnumAsByte<EButtonPressType>                      PressType;                                                // 0x0011(0x0001) (DataBinding)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0012(0x0002) MISSED OFFSET
	float                                              Speed;                                                    // 0x0014(0x0004) (DataBinding)
	unsigned long                                      bRequired : 1;                                            // 0x0018(0x0004) (DataBinding)
	TEnumAsByte<ERemappable>                           Remappable;                                               // 0x001C(0x0001)
	unsigned char                                      UnknownData01[0x3];                                       // 0x001D(0x0003) MISSED OFFSET
	float                                              PressedTime;                                              // 0x0020(0x0004) (Transient)
	float                                              ReleasedTime;                                             // 0x0024(0x0004) (Transient)
	unsigned long                                      bTapped : 1;                                              // 0x0028(0x0004) (Transient)
	unsigned long                                      bToggled : 1;                                             // 0x0028(0x0004) (Transient)
};

// ScriptStruct ProjectX.EffectsMap_X.EffectsMapping
// 0x0010
struct FEffectsMapping
{
	class UPhysicalMaterial*                           PhysicalMaterial;                                         // 0x0000(0x0008) (Edit)
	class UParticleSystem*                             Particle;                                                 // 0x0008(0x0008) (Edit)
};

// ScriptStruct ProjectX.EpochTimers_X.EpochTimer
// 0x0020
struct FEpochTimer
{
	struct FScriptDelegate                             Callback;                                                 // 0x0000(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	unsigned char                                      UnknownData01[0x8];                                       // 0x0018(0x0008) UNKNOWN PROPERTY: QWordProperty ProjectX.EpochTimers_X.EpochTimer.EpochTime
};

// ScriptStruct ProjectX._Types_X.MetricsEvent
// 0x0060
struct FMetricsEvent
{
	struct FUniqueNetId                                PlayerID;                                                 // 0x0000(0x0038)
	float                                              TimeSeconds;                                              // 0x0038(0x0004)
	int                                                Version;                                                  // 0x003C(0x0004)
	struct FString                                     EventName;                                                // 0x0040(0x0010) (NeedCtorLink)
	struct FString                                     EventData;                                                // 0x0050(0x0010) (NeedCtorLink)
};

// ScriptStruct ProjectX.FakeData_X.FakeData1
// 0x0035
struct FFakeData1
{
	struct FString                                     string1;                                                  // 0x0000(0x0010) (NeedCtorLink)
	struct FName                                       name1;                                                    // 0x0010(0x0008)
	unsigned long                                      bool1 : 1;                                                // 0x0018(0x0004)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	unsigned char                                      UnknownData01[0x8];                                       // 0x001C(0x0008) UNKNOWN PROPERTY: QWordProperty ProjectX.FakeData_X.FakeData1.qword1
	float                                              float1;                                                   // 0x0028(0x0004)
	unsigned char                                      byte1;                                                    // 0x002C(0x0001)
	unsigned char                                      UnknownData02[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
	int                                                int1;                                                     // 0x0030(0x0004)
	TEnumAsByte<EFakeDataEnum>                         enum1;                                                    // 0x0034(0x0001)
};

// ScriptStruct ProjectX.FakeData_X.FakeData2
// 0x0090
struct FFakeData2
{
	struct FFakeData1                                  struct1;                                                  // 0x0000(0x0038) (NeedCtorLink)
	struct FString                                     string1;                                                  // 0x0038(0x0010) (NeedCtorLink)
	struct FName                                       name1;                                                    // 0x0048(0x0008)
	unsigned long                                      bool1 : 1;                                                // 0x0050(0x0004)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
	unsigned char                                      UnknownData01[0x8];                                       // 0x0054(0x0008) UNKNOWN PROPERTY: QWordProperty ProjectX.FakeData_X.FakeData2.qword1
	float                                              float1;                                                   // 0x0060(0x0004)
	unsigned char                                      byte1;                                                    // 0x0064(0x0001)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0065(0x0003) MISSED OFFSET
	int                                                int1;                                                     // 0x0068(0x0004)
	TEnumAsByte<EFakeDataEnum>                         enum1;                                                    // 0x006C(0x0001)
	unsigned char                                      UnknownData03[0x3];                                       // 0x006D(0x0003) MISSED OFFSET
	TArray<struct FFakeData1>                          array1;                                                   // 0x0070(0x0010) (NeedCtorLink)
	TArray<struct FString>                             array2;                                                   // 0x0080(0x0010) (NeedCtorLink)
};

// ScriptStruct ProjectX.FakeData_X.FakeData3
// 0x0130
struct FFakeData3
{
	TArray<struct FFakeData2>                          array1;                                                   // 0x0000(0x0010) (NeedCtorLink)
	struct FString                                     string1;                                                  // 0x0010(0x0010) (NeedCtorLink)
	struct FFakeData1                                  struct1;                                                  // 0x0020(0x0038) (NeedCtorLink)
	struct FName                                       name1;                                                    // 0x0058(0x0008)
	TArray<struct FFakeData2>                          array2;                                                   // 0x0060(0x0010) (NeedCtorLink)
	TArray<struct FFakeData2>                          array3;                                                   // 0x0070(0x0010) (NeedCtorLink)
	unsigned long                                      bool1 : 1;                                                // 0x0080(0x0004)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0084(0x0004) MISSED OFFSET
	unsigned char                                      UnknownData01[0x8];                                       // 0x0084(0x0008) UNKNOWN PROPERTY: QWordProperty ProjectX.FakeData_X.FakeData3.qword1
	float                                              float1;                                                   // 0x0090(0x0004)
	unsigned char                                      byte1;                                                    // 0x0094(0x0001)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0095(0x0003) MISSED OFFSET
	int                                                int1;                                                     // 0x0098(0x0004)
	TEnumAsByte<EFakeDataEnum>                         enum1;                                                    // 0x009C(0x0001)
	unsigned char                                      UnknownData03[0x3];                                       // 0x009D(0x0003) MISSED OFFSET
	struct FFakeData2                                  struct2;                                                  // 0x00A0(0x0090) (NeedCtorLink)
};

// ScriptStruct ProjectX.FakeData_X.FakeData4
// 0x011D
struct FFakeData4
{
	struct FFakeData2                                  struct2;                                                  // 0x0000(0x0090) (NeedCtorLink)
	TArray<struct FFakeData3>                          array1;                                                   // 0x0090(0x0010) (NeedCtorLink)
	struct FFakeData1                                  struct1;                                                  // 0x00A0(0x0038) (NeedCtorLink)
	TArray<struct FFakeData2>                          array2;                                                   // 0x00D8(0x0010) (NeedCtorLink)
	struct FString                                     string1;                                                  // 0x00E8(0x0010) (NeedCtorLink)
	struct FName                                       name1;                                                    // 0x00F8(0x0008)
	unsigned long                                      bool1 : 1;                                                // 0x0100(0x0004)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0104(0x0004) MISSED OFFSET
	unsigned char                                      UnknownData01[0x8];                                       // 0x0104(0x0008) UNKNOWN PROPERTY: QWordProperty ProjectX.FakeData_X.FakeData4.qword1
	float                                              float1;                                                   // 0x0110(0x0004)
	unsigned char                                      byte1;                                                    // 0x0114(0x0001)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0115(0x0003) MISSED OFFSET
	int                                                int1;                                                     // 0x0118(0x0004)
	TEnumAsByte<EFakeDataEnum>                         enum1;                                                    // 0x011C(0x0001)
};

// ScriptStruct ProjectX.GameInfo_X.PauserData
// 0x000C
struct FPauserData
{
	class APlayerController*                           PC;                                                       // 0x0000(0x0008)
	int                                                PauseNum;                                                 // 0x0008(0x0004)
};

// ScriptStruct ProjectX.GFxDataStore_X.GFxDataStoreColumn
// 0x000C
struct FGFxDataStoreColumn
{
	TEnumAsByte<EASType>                               Type;                                                     // 0x0000(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FName                                       Name;                                                     // 0x0004(0x0008)
};

// ScriptStruct ProjectX.GFxDataStore_X.GFxDataStoreRow
// 0x0018
struct FGFxDataStoreRow
{
	TArray<struct FASValue>                            Values;                                                   // 0x0000(0x0010) (NeedCtorLink)
	class UGFxDataRow_X*                               BoundObject;                                              // 0x0010(0x0008)
};

// ScriptStruct ProjectX.GFxDataStore_X.GFxDataStoreTable
// 0x0080
struct FGFxDataStoreTable
{
	struct FName                                       Name;                                                     // 0x0000(0x0008)
	TArray<struct FGFxDataStoreColumn>                 Columns;                                                  // 0x0008(0x0010) (NeedCtorLink)
	TArray<struct FGFxDataStoreRow>                    Rows;                                                     // 0x0018(0x0010) (NeedCtorLink)
	unsigned long                                      bLevelTransitionPersistent : 1;                           // 0x0028(0x0004)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	struct FMap_Mirror                                 PrimaryKeyMap;                                            // 0x0030(0x0050) (Native)
};

// ScriptStruct ProjectX.GFxDataStore_X.GFxDirtyRow
// 0x0018
struct FGFxDirtyRow
{
	int                                                RowNum;                                                   // 0x0000(0x0004)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<struct FName>                               DirtyValues;                                              // 0x0008(0x0010) (NeedCtorLink)
};

// ScriptStruct ProjectX.GFxDataStore_X.GFxDirtyTable
// 0x0018
struct FGFxDirtyTable
{
	struct FName                                       Name;                                                     // 0x0000(0x0008)
	TArray<struct FGFxDirtyRow>                        DirtyRows;                                                // 0x0008(0x0010) (NeedCtorLink)
};

// ScriptStruct ProjectX.GFxEngine_X.DirtyObject
// 0x0014
struct FDirtyObject
{
	class UObject*                                     Object;                                                   // 0x0000(0x0008)
	class UProperty*                                   Property;                                                 // 0x0008(0x0008)
	int                                                Index;                                                    // 0x0010(0x0004)
};

// ScriptStruct ProjectX.GFxSoundPack_X.SoundPackSoundRef
// 0x0010
struct FSoundPackSoundRef
{
	class UAkSoundCue*                                 Sound;                                                    // 0x0000(0x0008) (Edit)
	struct FName                                       Name;                                                     // 0x0008(0x0008) (Edit)
};

// ScriptStruct ProjectX.LensFlareComponent_X.LensFlareFloatParamCurve
// 0x0038
struct FLensFlareFloatParamCurve
{
	struct FName                                       MaterialParamName;                                        // 0x0000(0x0008) (Edit)
	int                                                MaterialParamIndex;                                       // 0x0008(0x0004) (Edit)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	struct FRawDistributionFloat                       ValueOverTime;                                            // 0x0010(0x0028) (Edit, Component, NeedCtorLink)
};

// ScriptStruct ProjectX.LocalCache_X.CacheImportCallbackData
// 0x0020
struct FCacheImportCallbackData
{
	struct FPointer                                    Task;                                                     // 0x0000(0x0008) (Native)
	struct FScriptDelegate                             Callback;                                                 // 0x0008(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
};

// ScriptStruct ProjectX.LocalCache_X.CacheExportCallbackData
// 0x0020
struct FCacheExportCallbackData
{
	struct FPointer                                    Task;                                                     // 0x0000(0x0008) (Native)
	struct FScriptDelegate                             Callback;                                                 // 0x0008(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
};

// ScriptStruct ProjectX._Types_X.RenderProfile
// 0x0028
struct FRenderProfile
{
	float                                              GameThreadTime;                                           // 0x0000(0x0004)
	float                                              RenderThreadTime;                                         // 0x0004(0x0004)
	float                                              GPUTime;                                                  // 0x0008(0x0004)
	float                                              FrameTime;                                                // 0x000C(0x0004)
	float                                              FPS;                                                      // 0x0010(0x0004)
	float                                              AccumGameThreadTime;                                      // 0x0014(0x0004)
	float                                              AccumRenderThreadTime;                                    // 0x0018(0x0004)
	float                                              AccumGPUTime;                                             // 0x001C(0x0004)
	float                                              AccumFrameTime;                                           // 0x0020(0x0004)
	int                                                NumSamples;                                               // 0x0024(0x0004)
};

// ScriptStruct ProjectX._Types_X.NetStats
// 0x000C
struct U_Types_X_FNetStats
{
	float                                              PingMin;                                                  // 0x0000(0x0004)
	float                                              Jitter;                                                   // 0x0004(0x0004)
	float                                              LossPct;                                                  // 0x0008(0x0004)
};

// ScriptStruct ProjectX._NetworkNextTypes_X.NetworkNextStats
// 0x0018
struct FNetworkNextStats
{
	struct U_Types_X_FNetStats                         Direct;                                                   // 0x0000(0x000C)
	struct U_Types_X_FNetStats                         Next;                                                     // 0x000C(0x000C)
};

// ScriptStruct ProjectX.OnlineConfig_X.ModifierSubscription
// 0x0038
struct FModifierSubscription
{
	class UClass*                                      ObjClass;                                                 // 0x0000(0x0008)
	struct FScriptDelegate                             OnAdd;                                                    // 0x0008(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             OnRemove;                                                 // 0x0020(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0020(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
};

// ScriptStruct ProjectX.ContentConfig_X.ContentPair
// 0x001C
struct FContentPair
{
	struct FName                                       KeyName;                                                  // 0x0000(0x0008)
	struct FString                                     Content;                                                  // 0x0008(0x0010) (NeedCtorLink)
	struct FEncryptedKeyIndex                          Index;                                                    // 0x0018(0x0004) (Transient)
};

// ScriptStruct ProjectX._Types_X.CrossplayGroup
// 0x0010
struct FCrossplayGroup
{
	TArray<TEnumAsByte<EOnlinePlatform>>               Platforms;                                                // 0x0000(0x0010) (NeedCtorLink)
};

// ScriptStruct ProjectX.OnlineMessageComponent_X.OnlineMessageHandler
// 0x0018
struct FOnlineMessageHandler
{
	class UClass*                                      MessageClass;                                             // 0x0000(0x0008)
	TArray<struct FScriptDelegate>                     Delegates;                                                // 0x0008(0x0010) (NeedCtorLink)
};

// ScriptStruct ProjectX.ParameterDispenser_X.NameParamPair
// 0x0010
struct FNameParamPair
{
	struct FName                                       Key;                                                      // 0x0000(0x0008) (Edit)
	struct FName                                       Value;                                                    // 0x0008(0x0008) (Edit)
};

// ScriptStruct ProjectX.ParameterDispenser_X.FloatParamPair
// 0x000C
struct FFloatParamPair
{
	struct FName                                       Key;                                                      // 0x0000(0x0008) (Edit)
	float                                              Value;                                                    // 0x0008(0x0004) (Edit)
};

// ScriptStruct ProjectX.ParameterDispenser_X.VectorParamPair
// 0x0014
struct FVectorParamPair
{
	struct FName                                       Key;                                                      // 0x0000(0x0008) (Edit)
	struct FVector                                     Value;                                                    // 0x0008(0x000C) (Edit)
};

// ScriptStruct ProjectX.ParameterDispenser_X.ColorParamPair
// 0x0018
struct FColorParamPair
{
	struct FName                                       Key;                                                      // 0x0000(0x0008) (Edit)
	struct FLinearColor                                Value;                                                    // 0x0008(0x0010) (Edit)
};

// ScriptStruct ProjectX.ParameterDispenser_X.ActorParamPair
// 0x0010
struct FActorParamPair
{
	struct FName                                       Key;                                                      // 0x0000(0x0008) (Edit)
	class AActor*                                      Value;                                                    // 0x0008(0x0008) (Edit)
};

// ScriptStruct ProjectX.PlayerInput_X.GamepadDeadzoneSettings
// 0x0010
struct FGamepadDeadzoneSettings
{
	TEnumAsByte<EInputPlatformType>                    Type;                                                     // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FName                                       Key;                                                      // 0x0004(0x0008) (Edit)
	float                                              Deadzone;                                                 // 0x000C(0x0004) (Edit)
};

// ScriptStruct ProjectX.PlayerInput_X.KeyboardAxisBlendSettings
// 0x000C
struct FKeyboardAxisBlendSettings
{
