#pragma once

// Rocket League (1.31) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class ProjectX._NetworkNextTypes_X
// 0x0000 (0x0060 - 0x0060)
class U_NetworkNextTypes_X : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX._NetworkNextTypes_X");
		return ptr;
	}

};


// Class ProjectX._SharedHelpers
// 0x0000 (0x0060 - 0x0060)
class U_SharedHelpers : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX._SharedHelpers");
		return ptr;
	}


	int STATIC_ScoreDeltaFromDefault(class UObject* Object);
	int STATIC_FindNetId(const struct FUniqueNetId& FindId, TArray<struct FUniqueNetId>* List);
	void STATIC_DrawShadowedText(class UCanvas* Canvas, const struct FString& Text, int ShadowOffsetX, int ShadowOffsetY, int ShadowAlpha);
	bool STATIC_IsInTransientPackage(class UObject* Obj);
	class APlayerController* STATIC_GetAPlayerController(class UClass* PlayerControllerClass);
	class UObject* STATIC_GetDefaultObject(class UClass* ObjClass);
	void STATIC_DumpUnreferencedAnims();
	struct FString STATIC_GetLanguageExtension();
};


// Class ProjectX._Types_X
// 0x0060 (0x00C0 - 0x0060)
class U_Types_X : public UObject
{
public:
	struct FScriptDelegate                             __KeyPressDelegate__Delegate;                             // 0x0060(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0060(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __OnPriviledgeChecked__Delegate;                          // 0x0078(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0078(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __ServiceExecutionDelegate__Delegate;                     // 0x0090(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0090(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __OnTimer__Delegate;                                      // 0x00A8(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData03[0x8];                                       // 0x00A8(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX._Types_X");
		return ptr;
	}


	void OnTimer();
	struct FServerReservationData STATIC_GetServerReservationData(struct FCheckReservationResponse* Response);
	void ServiceExecutionDelegate(class UPsyNetClientService_X* Service);
	struct FIntVector3 STATIC_ToIntVector3(const struct FVector& V);
	void OnPriviledgeChecked(class UPrivilegeCheck_X* PrivilegeCheck);
	bool KeyPressDelegate();
};


// Class ProjectX.ActorComponent_X
// 0x0007 (0x00A4 - 0x009D)
class UActorComponent_X : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x3];                                       // 0x009D(0x0003) MISSED OFFSET
	unsigned long                                      bTick : 1;                                                // 0x00A0(0x0004)
	unsigned long                                      bIgnoreScriptAttach : 1;                                  // 0x00A0(0x0004) (Const, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.ActorComponent_X");
		return ptr;
	}


	void Reattach();
	void Tick(float DeltaTime);
	void Detached();
	void Attached();
	void BeginPlay();
};


// Class ProjectX.ExplosionComponent_X
// 0x003C (0x00E0 - 0x00A4)
class UExplosionComponent_X : public UActorComponent_X
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x00A4(0x0004) MISSED OFFSET
	float                                              RBVelocityChange;                                         // 0x00A8(0x0004) (Edit)
	float                                              StartRadius;                                              // 0x00AC(0x0004) (Edit)
	float                                              EndRadius;                                                // 0x00B0(0x0004) (Edit)
	float                                              Speed;                                                    // 0x00B4(0x0004) (Edit)
	float                                              Falloff;                                                  // 0x00B8(0x0004) (Edit)
	unsigned long                                      bPassThroughWorldGeometry : 1;                            // 0x00BC(0x0004) (Edit)
	unsigned long                                      bIgnoreInstigator : 1;                                    // 0x00BC(0x0004) (Edit)
	unsigned long                                      bDebug : 1;                                               // 0x00BC(0x0004) (Edit)
	struct FVector                                     MomentumOffset;                                           // 0x00C0(0x000C) (Edit)
	float                                              LifeTime;                                                 // 0x00CC(0x0004) (Transient)
	TArray<class AActor*>                              DamagedActors;                                            // 0x00D0(0x0010) (Transient, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.ExplosionComponent_X");
		return ptr;
	}


	void ProcessHit(class AActor* Victim, const struct FVector& HitLocation, const struct FTraceHitInfo& ExtraHitInfo, float DamageScale);
	void Detached();
};


// Class ProjectX.ExplosionHitHandler_X
// 0x0050 (0x00F4 - 0x00A4)
class UExplosionHitHandler_X : public UActorComponent_X
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x00A4(0x0004) MISSED OFFSET
	float                                              StartTime;                                                // 0x00A8(0x0004) (Edit)
	float                                              EndTime;                                                  // 0x00AC(0x0004) (Edit)
	class UExplosionCollisionShapes_X*                 CollisionInformation;                                     // 0x00B0(0x0008) (Edit, ExportObject, Component, EditInline)
	unsigned long                                      bIgnoreInstigator : 1;                                    // 0x00B8(0x0004) (Edit)
	unsigned long                                      bPassThroughWorldGeometry : 1;                            // 0x00B8(0x0004) (Edit)
	unsigned long                                      bOnlyApplyImpulseOnce : 1;                                // 0x00B8(0x0004) (Edit)
	unsigned long                                      bDebug : 1;                                               // 0x00B8(0x0004) (Edit)
	unsigned long                                      bPullTowardHitLocation : 1;                               // 0x00B8(0x0004) (Edit)
	float                                              Falloff;                                                  // 0x00BC(0x0004) (Edit)
	float                                              RBVelocityChange;                                         // 0x00C0(0x0004) (Edit)
	float                                              Speed;                                                    // 0x00C4(0x0004) (Edit)
	struct FVector                                     MomentumOffset;                                           // 0x00C8(0x000C) (Edit)
	struct FBox                                        GoalWorldBox;                                             // 0x00D4(0x001C) (Transient)
	float                                              LifeTime;                                                 // 0x00F0(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.ExplosionHitHandler_X");
		return ptr;
	}


	void Destroy();
	void Init();
	void ProcessHit(class AActor* Victim, const struct FVector& HitLocation, float DamageScale, struct FContactInformation* ContactInfo);
};


// Class ProjectX.FXActor_X
// 0x00C0 (0x0328 - 0x0268)
class AFXActor_X : public AActor
{
public:
	class UFXActorEvent_X*                             SpawnState;                                               // 0x0268(0x0008)
	class UFXActorEvent_X*                             ActivationState;                                          // 0x0270(0x0008)
	TArray<struct FFXAttachment>                       Attachments;                                              // 0x0278(0x0010) (Edit, Component, NeedCtorLink)
	struct FName                                       SocketOrBoneName;                                         // 0x0288(0x0008) (Edit)
	unsigned long                                      bDeactivateWhenOwnerDestroyed : 1;                        // 0x0290(0x0004) (Edit)
	unsigned long                                      bAllowShadowCasting : 1;                                  // 0x0290(0x0004) (Edit)
	unsigned long                                      bAutoActivate : 1;                                        // 0x0290(0x0004) (Edit)
	unsigned long                                      bRenderInactive : 1;                                      // 0x0290(0x0004) (Edit)
	unsigned long                                      bActive : 1;                                              // 0x0290(0x0004) (Transient)
	unsigned long                                      bHadOwner : 1;                                            // 0x0290(0x0004) (Const, Transient)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0294(0x0004) MISSED OFFSET
	class AFXActor_X*                                  Parent;                                                   // 0x0298(0x0008) (Edit)
	class AActor*                                      AttachmentActor;                                          // 0x02A0(0x0008) (Transient)
	TArray<class UFXActorEvent_X*>                     FXStates;                                                 // 0x02A8(0x0010) (Transient, NeedCtorLink)
	TArray<struct FFXActorEventCheck>                  FXEvents;                                                 // 0x02B8(0x0010) (Transient, NeedCtorLink)
	float                                              DestroyWaitTime;                                          // 0x02C8(0x0004) (Edit)
	float                                              DestroyTime;                                              // 0x02CC(0x0004)
	class UParameterDispenser_X*                       Parameters;                                               // 0x02D0(0x0008) (Edit, ExportObject, Component, EditInline)
	int                                                EditID;                                                   // 0x02D8(0x0004) (Edit, Const, EditConst)
	unsigned char                                      UnknownData01[0x4];                                       // 0x02DC(0x0004) MISSED OFFSET
	TArray<struct FFXEventSubscription>                EventSubscriptions;                                       // 0x02E0(0x0010) (Const, Transient, NeedCtorLink)
	class UFXActorEvent_X*                             AnimationEndState;                                        // 0x02F0(0x0008)
	struct FScriptDelegate                             __EventFXStatePushed__Delegate;                           // 0x02F8(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData02[0x8];                                       // 0x02F8(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventFXStatePopped__Delegate;                           // 0x0310(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData03[0x8];                                       // 0x0310(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.FXActor_X");
		return ptr;
	}


	void DumpDebugInfo();
	class UFXAttachmentTraitBase_X* GetTrait(class UClass* TraitClass, int AttachmentIdx);
	void OnAnimEnd(class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime);
	void OnAnimPlay(class UAnimNodeSequence* SeqNode);
	void Destroyed();
	void SubscribeState(class UFXActorEvent_X* FXEvent, const struct FScriptDelegate& OnPushed, const struct FScriptDelegate& OnPopped);
	void SetStateEnabled(class UFXActorEvent_X* State, bool bEnable);
	void OnToggle(class USeqAct_Toggle* Action);
	void OnTriggerFXActor_X(class USeqAct_TriggerFXActor_X* SeqAct);
	void Inherit(class AFXActor_X* Other);
	void ResetParticles();
	void StopAllEffects();
	void DeactivateAndDestroy();
	void OnDetached(class UActorComponent* AC);
	void DeactivateFXComponent(class UActorComponent* AC);
	void ActivateFXComponent(class UActorComponent* AC);
	void OnAttached(class UActorComponent* AC);
	void UpdateFXStates();
	bool IsLocallyControlled();
	class AController* GetControllerOwner();
	void ToggleState(class UFXActorEvent_X* NewState);
	bool RemoveStateForceUpdate(class UFXActorEvent_X* OldState);
	bool RemoveEvent(class UFXActorEvent_X* OldEvent);
	bool RemoveState(class UFXActorEvent_X* OldState);
	void AddEvent(class UFXActorEvent_X* NewEvent);
	void AddState(class UFXActorEvent_X* NewState);
	bool CanRemoveEvent(struct FFXActorEventCheck* InEvent);
	bool IsStateActive(class UFXActorEvent_X* InState);
	void Deactivate();
	void Activate();
	void HandleParentStatePopped(class AFXActor_X* P, class UFXActorEvent_X* Event);
	void HandleParentStatePushed(class AFXActor_X* P, class UFXActorEvent_X* Event);
	void BindTo(class AFXActor_X* ParentFXActor);
	void SetAttachmentActor(class AActor* AttachToActor);
	void PostBeginPlay();
	void AllAttachments(class UClass* ComponentClass, class UActorComponent** OutComponent, int* OutAttachmentIdx);
	class UActorComponent* GetComponentByName(class UClass* ComponentClass, const struct FName& ComponentName);
	void EventFXStatePopped(class AFXActor_X* FXActor, class UFXActorEvent_X* Event);
	void EventFXStatePushed(class AFXActor_X* FXActor, class UFXActorEvent_X* Event);
};


// Class ProjectX.MICParamDispenserComponent_X
// 0x0024 (0x00C8 - 0x00A4)
class UMICParamDispenserComponent_X : public UActorComponent_X
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x00A4(0x0004) MISSED OFFSET
	struct FPointer                                    VfTable_IISetParameter;                                   // 0x00A8(0x0008) (Const, Native, NoExport)
	int                                                MaterialIndex;                                            // 0x00B0(0x0004) (Edit)
	struct FName                                       AttachedComponentName;                                    // 0x00B4(0x0008) (Edit)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00BC(0x0004) MISSED OFFSET
	class UMeshComponent*                              MeshComp;                                                 // 0x00C0(0x0008) (ExportObject, Component, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.MICParamDispenserComponent_X");
		return ptr;
	}


	bool __MICParamDispenserComponent_X__Attached_EF2C561444A6C8C7ACADEEADF860F32B(const struct FFXAttachment& A);
	void Attached();
	void SetActorParameter(const struct FName& Key, class AActor* Value);
	void SetLinearColorParameter(const struct FName& Key, const struct FLinearColor& Value);
	void SetVectorParameter(const struct FName& Key, const struct FVector& Value);
	void SetFloatParameter(const struct FName& Key, float Value);
	void SetNameParameter(const struct FName& Key, const struct FName& Value);
};


// Class ProjectX.ShakeComponent_X
// 0x0114 (0x01B8 - 0x00A4)
class UShakeComponent_X : public UActorComponent_X
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x00A4(0x0004) MISSED OFFSET
	float                                              InnerRadius;                                              // 0x00A8(0x0004) (Edit)
	float                                              OuterRadius;                                              // 0x00AC(0x0004) (Edit)
	float                                              Falloff;                                                  // 0x00B0(0x0004) (Edit)
	unsigned long                                      bAutoPlay : 1;                                            // 0x00B4(0x0004) (Edit)
	unsigned long                                      bAutoDetach : 1;                                          // 0x00B4(0x0004) (Edit)
	unsigned long                                      bOnlyAffectPlayersWithPawns : 1;                          // 0x00B4(0x0004) (Edit)
	unsigned long                                      bAttenuate : 1;                                           // 0x00B4(0x0004) (Edit)
	unsigned long                                      bPlaying : 1;                                             // 0x00B4(0x0004) (Transient)
	unsigned long                                      bStopping : 1;                                            // 0x00B4(0x0004) (Transient)
	TEnumAsByte<EShakeReceiver>                        Receiver;                                                 // 0x00B8(0x0001) (Edit)
	unsigned char                                      UnknownData01[0x3];                                       // 0x00B9(0x0003) MISSED OFFSET
	float                                              RadiusScale;                                              // 0x00BC(0x0004) (Edit)
	float                                              BlendInTime;                                              // 0x00C0(0x0004) (Edit)
	float                                              BlendOutTime;                                             // 0x00C4(0x0004) (Edit)
	class UCameraShake*                                ShakeParams;                                              // 0x00C8(0x0008) (Edit)
	struct FRawDistributionFloat                       AmplitudeScale;                                           // 0x00D0(0x0028) (Edit, Component, NeedCtorLink)
	struct FRawDistributionFloat                       FrequencyScale;                                           // 0x00F8(0x0028) (Edit, Component, NeedCtorLink)
	struct FRawDistributionFloat                       DurationScale;                                            // 0x0120(0x0028) (Edit, Component, NeedCtorLink)
	float                                              CurrentAmplitudeScale;                                    // 0x0148(0x0004) (Const, Transient)
	float                                              CurrentFrequencyScale;                                    // 0x014C(0x0004) (Const, Transient)
	class UForceFeedbackWaveform*                      ForceFeedbackWaveform;                                    // 0x0150(0x0008) (Edit)
	float                                              ForceFeedbackScale;                                       // 0x0158(0x0004) (Edit)
	float                                              ForceFeedbackBalance;                                     // 0x015C(0x0004) (Edit)
	TArray<struct FParticleSysParam>                   InstanceParameters;                                       // 0x0160(0x0010) (Edit, NeedCtorLink, EditInline)
	float                                              PlayTime;                                                 // 0x0170(0x0004) (Transient)
	float                                              StopTime;                                                 // 0x0174(0x0004) (Transient)
	struct FVector                                     ShakeLocTimeOffset;                                       // 0x0178(0x000C) (Transient)
	struct FVector                                     ShakeRotTimeOffset;                                       // 0x0184(0x000C) (Transient)
	float                                              ShakeFOVTimeOffset;                                       // 0x0190(0x0004) (Transient)
	float                                              CameraShakeDuration;                                      // 0x0194(0x0004) (Transient)
	float                                              ForceFeedbackDuration;                                    // 0x0198(0x0004) (Transient)
	float                                              ForceFeedbackSamplesTime;                                 // 0x019C(0x0004) (Transient)
	class AActor*                                      PrevOwner;                                                // 0x01A0(0x0008) (Transient)
	TArray<struct FShakeReceiver>                      Receivers;                                                // 0x01A8(0x0010) (Transient, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.ShakeComponent_X");
		return ptr;
	}


	bool GetColorParameter(const struct FName& InName, struct FColor* OutColor);
	bool GetVectorParameter(const struct FName& InName, struct FVector* OutVector);
	bool GetFloatParameter(const struct FName& InName, float* OutFloat);
	void SetColorParameter(const struct FName& ParameterName, const struct FColor& Param);
	void SetVectorRandParameter(const struct FName& ParameterName, struct FVector* Param, struct FVector* ParamLow);
	void SetVectorParameter(const struct FName& ParameterName, const struct FVector& Param);
	void SetFloatRandParameter(const struct FName& ParameterName, float Param, float ParamLow);
	void SetFloatParameter(const struct FName& ParameterName, float Param);
	bool IsPlaying();
	void StopShake(float InBlendOutTime);
	void InitParams();
	void PlayShake();
	void Detached();
	void Attached();
};


// Class ProjectX.AdHocBeacon_X
// 0x0010 (0x0070 - 0x0060)
class UAdHocBeacon_X : public UObject
{
public:
	struct FPointer                                    VfTable_FTickableObject;                                  // 0x0060(0x0008) (Const, Native, NoExport)
	struct FPointer                                    pAdHoc;                                                   // 0x0068(0x0008) (Const, Native, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.AdHocBeacon_X");
		return ptr;
	}


	int GetNodeCountMax();
	void AdHocJoinMatch();
	void AdHocCreateMatch();
	bool AdHocIsActive();
	void AdHocDisconnectFromAccessPoint();
	void AdHocConnectToAccessPoint(int ScanResultIndex);
	void AdHocScanForAccessPoints();
	void AdHocBecomeStation();
	void AdHocRejectStation(int NetworkNodeIndex);
	void AdHocBecomeAccessPoint();
	void AdHocSetAdvertiseData(const struct FString& AdvertiseData);
	void AdHocDestroy();
	void AdHocCreate();
	void AdHocCreateWithUsername(const struct FString& Username);
	void Construct();
};


// Class ProjectX.AnimateParametersComponent_X
// 0x003F (0x00DC - 0x009D)
class UAnimateParametersComponent_X : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x3];                                       // 0x009D(0x0003) MISSED OFFSET
	TArray<struct FAnimatedFloatParam>                 FloatParameters;                                          // 0x00A0(0x0010) (Edit, NeedCtorLink)
	TArray<struct FAnimatedVectorParam>                VectorParameters;                                         // 0x00B0(0x0010) (Edit, NeedCtorLink)
	TArray<struct FAnimatedLinearColorParam>           ColorParameters;                                          // 0x00C0(0x0010) (Edit, NeedCtorLink)
	unsigned long                                      bResetMaterialsOnComplete : 1;                            // 0x00D0(0x0004) (Edit)
	float                                              AnimTime;                                                 // 0x00D4(0x0004) (Transient)
	float                                              EndTime;                                                  // 0x00D8(0x0004) (Const, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.AnimateParametersComponent_X");
		return ptr;
	}

};


// Class ProjectX.ArchetypePrefab_X
// 0x0020 (0x0288 - 0x0268)
class AArchetypePrefab_X : public AActor
{
public:
	TArray<class AActor*>                              PrefabArchetypes;                                         // 0x0268(0x0010) (Edit, NeedCtorLink)
	TArray<class AActor*>                              ArchetypeInstances;                                       // 0x0278(0x0010) (Const, Transient, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.ArchetypePrefab_X");
		return ptr;
	}

};


// Class ProjectX.ArchetypeSpawnPoint_X
// 0x0070 (0x02D8 - 0x0268)
class AArchetypeSpawnPoint_X : public AActor
{
public:
	struct FPointer                                    VfTable_IInterface_NavMeshPathObject;                     // 0x0268(0x0008) (Const, Native, NoExport)
	struct FString                                     ArchetypePath;                                            // 0x0270(0x0010) (Edit, Const, NeedCtorLink)
	unsigned long                                      bSeedNavMesh : 1;                                         // 0x0280(0x0004) (Edit)
	unsigned long                                      bSpawnOnLevelStart : 1;                                   // 0x0280(0x0004) (Edit)
	unsigned long                                      bOnlyAllowOneInstance : 1;                                // 0x0280(0x0004) (Edit)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0284(0x0004) MISSED OFFSET
	class AActor*                                      ActorArchetype;                                           // 0x0288(0x0008) (Edit)
	class USpriteComponent*                            PlacementSprite;                                          // 0x0290(0x0008) (ExportObject, Component, EditInline)
	class USkeletalMeshComponent*                      ArchetypeSkeletalMesh;                                    // 0x0298(0x0008) (ExportObject, Component, EditInline)
	class UStaticMeshComponent*                        ArchetypeStaticMesh;                                      // 0x02A0(0x0008) (ExportObject, Component, EditInline)
	TArray<class AActor*>                              SpawnedActors;                                            // 0x02A8(0x0010) (Transient, NeedCtorLink)
	class AActor*                                      SpawnedActor;                                             // 0x02B8(0x0008) (Transient)
	struct FScriptDelegate                             __EventSpawned__Delegate;                                 // 0x02C0(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData01[0x8];                                       // 0x02C0(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.ArchetypeSpawnPoint_X");
		return ptr;
	}


	void OnSpawned(class AActor* Spawned);
	class AActor* DoSpawn();
	void OnToggle(class USeqAct_Toggle* Action);
	void OnDestroy(class USeqAct_Destroy* Action);
	void PostBeginPlay();
	void EventSpawned(class AArchetypeSpawnPoint_X* SpawnPoint, class AActor* Spawned);
};


// Class ProjectX.Aws4Signature_X
// 0x0000 (0x0060 - 0x0060)
class UAws4Signature_X : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.Aws4Signature_X");
		return ptr;
	}


	void STATIC_SignRequest(class UHttpRequestInterface* HTTPRequest);
};


// Class ProjectX.ReservationBeacon_X
// 0x0068 (0x00D8 - 0x0070)
class UReservationBeacon_X : public UComponent
{
public:
	TArray<struct FBeaconMessageHandler>               MessageHandlers;                                          // 0x0070(0x0010) (Const, NeedCtorLink)
	class UTcpMessageBeacon*                           TcpBeacon;                                                // 0x0080(0x0008) (ExportObject, Component, EditInline)
	class UPsyNetBeacon_X*                             PsyNetBeacon;                                             // 0x0088(0x0008) (ExportObject, Component, EditInline)
	struct FScriptDelegate                             __MessageReceivedDelegate__Delegate;                      // 0x0090(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0090(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventConnected__Delegate;                               // 0x00A8(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData01[0x8];                                       // 0x00A8(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventDisconnected__Delegate;                            // 0x00C0(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData02[0x8];                                       // 0x00C0(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.ReservationBeacon_X");
		return ptr;
	}


	void __ReservationBeacon_X__Construct_75C9F51D4572115C73000DBAB3A507DB();
	void __ReservationBeacon_X__Construct_EEDFBDBC4DBCD532D5FE3AAF983874A1(class UPsyNetBeaconConnection_X* Connection, class UObject* Message);
	void __ReservationBeacon_X__Construct_68DA6D0A45453AF25FBAA686F5A48968(class UPsyNetBeacon_X* _, class UPsyNetBeaconConnection_X* Connection);
	void __ReservationBeacon_X__Construct_20189EA2468F1B4D1404F08901962798(class UPsyNetBeacon_X* _, class UPsyNetBeaconConnection_X* Connection);
	void __ReservationBeacon_X__Construct_DFCCB62543E9695679FF0D9F5B14CBB9(class UTcpConnection* Connection, class UObject* Message);
	void __ReservationBeacon_X__Construct_1DDC728E4A1FA030B0D35683B5AFED7B(class UTcpBeacon* _, class UTcpConnection* Connection);
	void __ReservationBeacon_X__Construct_9F5DE8554BBF1E9B5763D39797133CF0(class UTcpBeacon* _, class UTcpConnection* Connection);
	TScriptInterface<class UIReservationConnection_X> BeginPsyNetConnect(const struct FString& ReservationID, const struct FString& DSRToken);
	TScriptInterface<class UIReservationConnection_X> BeginTcpConnect(const struct FString& BeaconURL);
	TScriptInterface<class UIReservationConnection_X> BeginConnect(const struct FServerReservationData& Reservation);
	void Close();
	void CloseConnection(const TScriptInterface<class UIReservationConnection_X>& Connection);
	void BroadcastMessage(class UObject* Message);
	void SendMessage(const TScriptInterface<class UIReservationConnection_X>& Connection, class UObject* Message);
	class UBeaconMessage_X* CreateMessage(class UClass* MessageClass);
	void ReceiveMessage(const TScriptInterface<class UIReservationConnection_X>& Connection, class UObject* Message);
	void RemoveMessageHandler(const struct FScriptDelegate& Callback);
	void AddMessageHandler(class UClass* MessageClass, const struct FScriptDelegate& Callback);
	void BeginListen();
	void Construct();
	void EventDisconnected(class UReservationBeacon_X* Beacon, const TScriptInterface<class UIReservationConnection_X>& Connection);
	void EventConnected(class UReservationBeacon_X* Beacon, const TScriptInterface<class UIReservationConnection_X>& Connection);
	void MessageReceivedDelegate(const TScriptInterface<class UIReservationConnection_X>& Connection, class UObject* Message);
};


// Class ProjectX.BeaconMessage_X
// 0x0000 (0x0060 - 0x0060)
class UBeaconMessage_X : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.BeaconMessage_X");
		return ptr;
	}


	class UBeaconMessage_X* Broadcast();
	class UBeaconMessage_X* Send(const TScriptInterface<class UIReservationConnection_X>& Connection);
};


// Class ProjectX.BugReport_X
// 0x0154 (0x01B4 - 0x0060)
class UBugReport_X : public UObject
{
public:
	struct FPointer                                    VfTable_FTickableObject;                                  // 0x0060(0x0008) (Const, Native, NoExport)
	struct FString                                     BugReportClassName;                                       // 0x0068(0x0010) (Config, GlobalConfig, NeedCtorLink)
	struct FString                                     URL;                                                      // 0x0078(0x0010) (Edit, NeedCtorLink)
	int                                                MaxFileSizeMegabytes;                                     // 0x0088(0x0004) (Edit)
	unsigned char                                      UnknownData00[0x4];                                       // 0x008C(0x0004) MISSED OFFSET
	struct FString                                     BugID;                                                    // 0x0090(0x0010) (Const, Transient, NeedCtorLink)
	struct FBugReportSubmitterData                     SubmitterData;                                            // 0x00A0(0x0030) (Const, Transient, NeedCtorLink)
	struct FBugReportSystemData                        SystemData;                                               // 0x00D0(0x0038) (Const, Transient, NeedCtorLink)
	struct FBugReportPathData                          PathData;                                                 // 0x0108(0x0040) (Const, Transient, NeedCtorLink)
	struct FBugReportDescriptionData                   DescriptionData;                                          // 0x0148(0x0050) (Const, Transient, NeedCtorLink)
	struct FPointer                                    LogFile;                                                  // 0x0198(0x0008) (Const, Native, Transient)
	TArray<struct FFileUploadData>                     FileUploads;                                              // 0x01A0(0x0010) (Const, Transient, NeedCtorLink)
	unsigned long                                      bUploadNextFile : 1;                                      // 0x01B0(0x0004) (Const, Transient)
	unsigned long                                      bSubmitted : 1;                                           // 0x01B0(0x0004) (Const, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.BugReport_X");
		return ptr;
	}


	void HandleHttpRequestComplete(class UHttpRequestInterface* OriginalRequest, class UHttpResponseInterface* InHttpResponse, bool bDidSucceed);
	void LogText(const struct FString& Str);
	void PDIReport();
	void CancelBugReport();
	void SubmitBugReport(const struct FString& Title, const struct FString& Description, const struct FString& Email);
	void StartBugReport();
	void STATIC_StaticSubmitBugReport(const struct FString& Title);
	class UBugReport_X* STATIC_CreateBugReport();
};


// Class ProjectX.CachedWebData_X
// 0x004C (0x00AC - 0x0060)
class UCachedWebData_X : public UObject
{
public:
	TArray<unsigned char>                              Data;                                                     // 0x0060(0x0010) (Const, NeedCtorLink)
	int                                                DataCRC;                                                  // 0x0070(0x0004) (Const)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0074(0x0004) MISSED OFFSET
	struct FString                                     ETag;                                                     // 0x0078(0x0010) (Const, NeedCtorLink)
	struct FString                                     ContentType;                                              // 0x0088(0x0010) (Const, NeedCtorLink)
	class UError*                                      LoadError;                                                // 0x0098(0x0008) (Transient)
	class UError*                                      DownloadError;                                            // 0x00A0(0x0008) (Transient)
	unsigned long                                      bNewData : 1;                                             // 0x00A8(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.CachedWebData_X");
		return ptr;
	}


	struct FString GetText();
	void SetData(TArray<unsigned char> NewData, const struct FString& NewETag, const struct FString& NewContentType);
};


// Class ProjectX.Camera_X
// 0x0110 (0x06C8 - 0x05B8)
class ACamera_X : public ACamera
{
public:
	TArray<class UCameraState_X*>                      States;                                                   // 0x05B8(0x0010) (Edit, NeedCtorLink)
	struct FRotator                                    PCDeltaRotation;                                          // 0x05C8(0x000C) (Transient)
	struct FRotator                                    OldControllerRotation;                                    // 0x05D4(0x000C) (Transient)
	struct FVector                                     PCDeltaLocation;                                          // 0x05E0(0x000C) (Transient)
	struct FVector                                     OldControllerLocation;                                    // 0x05EC(0x000C) (Transient)
	struct FCameraOrientation                          PreProcessPOV;                                            // 0x05F8(0x002C) (Transient)
	struct FCameraOrientation                          PostProcessPOV;                                           // 0x0624(0x002C) (Transient)
	class UCameraStateBlender_X*                       Blender;                                                  // 0x0650(0x0008) (ExportObject, Component, EditInline)
	struct FVector                                     ShakeLocationOffset;                                      // 0x0658(0x000C) (Const, Transient)
	struct FRotator                                    ShakeRotationOffset;                                      // 0x0664(0x000C) (Const, Transient)
	float                                              ShakeFOVOffset;                                           // 0x0670(0x0004) (Const, Transient)
	struct FColor                                      StartFadeColor;                                           // 0x0674(0x0004) (Transient)
	struct FColor                                      EndFadeColor;                                             // 0x0678(0x0004) (Transient)
	struct FVector                                     ClipOffset;                                               // 0x067C(0x000C) (Transient)
	TArray<struct FLocationCameraKnock>                LocationKnocks;                                           // 0x0688(0x0010) (Transient, NeedCtorLink)
	TArray<struct FRotationCameraKnock>                RotationKnocks;                                           // 0x0698(0x0010) (Transient, NeedCtorLink)
	unsigned long                                      bDisableCameraShake : 1;                                  // 0x06A8(0x0004) (Transient)
	unsigned long                                      bSnapNextTransition : 1;                                  // 0x06A8(0x0004) (Transient)
	unsigned char                                      UnknownData00[0x4];                                       // 0x06AC(0x0004) MISSED OFFSET
	struct FScriptDelegate                             __EventCameraStateChanged__Delegate;                      // 0x06B0(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData01[0x8];                                       // 0x06AC(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.Camera_X");
		return ptr;
	}


	void __Camera_X__Destroyed_648939314304937BDCBA8194BD55EAB1(class UCameraState_X* S);
	void Destroyed();
	void OnViewTargetChanged();
	void SetViewTarget(class AActor* NewViewTarget, const struct FViewTargetTransitionParams& TransitionParams);
	bool IsTransitioning();
	void HandleBlenderStateChanged(class UCameraStateBlender_X* CameraBlender);
	void SnapTransition();
	void PrintDebugInfo(class UDebugDrawer* Drawer);
	void ApplyCameraModifiers(float DeltaTime, struct FTPOV* OutPOV);
	bool CameraTrace(const struct FVector& End, const struct FVector& Start, const struct FVector& Extent, struct FVector* HitLoc, class AActor** HitActor);
	class UCameraState_X* InstanceCameraState(class UCameraState_X* Archetype);
	void ModifyPostProcessSettings(struct FPostProcessSettings* PP);
	void ProcessViewRotation(float DeltaTime, struct FRotator* OutViewRotation, struct FRotator* OutDeltaRot);
	void PostProcessCameraState(float DeltaTime, struct FCameraOrientation* OutPOV);
	void ProcessCameraState(float DeltaTime, struct FCameraOrientation* OutPOV);
	void CheckViewTarget(struct FTViewTarget* VT);
	void CopyFade(class ACamera_X* Other);
	void SetCameraFade(bool bNewEnableFading, const struct FColor& NewFadeColor, const struct FVector2D& NewFadeAlpha, float NewFadeTime, bool bNewFadeAudio);
	void UpdateFade(float DeltaTime);
	void UpdateCamera(float DeltaTime);
	void ClampPOV(struct FCameraOrientation* OutPOV);
	struct FRotator RemoveRoll(const struct FRotator& InRot);
	class UCameraState_X* GetCameraState();
	class UCameraState_X* SelectCameraState();
	void UpdateCameraState();
	void UpdateCameraKnocks(float DeltaTime, struct FCameraOrientation* OutPOV);
	void AddRotationKnock(const struct FRotationCameraKnock& Knock, float Scale);
	void AddLocationKnock(const struct FLocationCameraKnock& Knock, float Scale, const struct FRotator& Transform);
	void InstanceCameraStates();
	void InitializeFor(class APlayerController* PC);
	void ModifyCameraShakeScale(class UCameraShake* Shake, float NewScale);
	void OnLoadingMovieClosesd();
	void PostBeginPlay();
	struct FVector STATIC_InterpVector(const struct FVector& OldValue, const struct FVector& NewValue, const struct FVectorInterpRate& Rate, const struct FRotator& Orientation, float DeltaTime);
	void STATIC_FinalizeOrientation(struct FCameraOrientation* OutPOV);
	struct FCameraOrientation STATIC_BlendCameraOrientations(float Alpha, struct FCameraOrientation* A, struct FCameraOrientation* B);
	void EventCameraStateChanged(class ACamera_X* Camera, class UCameraState_X* CameraState);
};


// Class ProjectX.CameraAttachmentComponent_X
// 0x0017 (0x00B4 - 0x009D)
class UCameraAttachmentComponent_X : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x3];                                       // 0x009D(0x0003) MISSED OFFSET
	TArray<class UActorComponent*>                     Attachments;                                              // 0x00A0(0x0010) (Edit, ExportObject, Component, NeedCtorLink, EditInline)
	unsigned long                                      bDirtyTransform : 1;                                      // 0x00B0(0x0004) (Const, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.CameraAttachmentComponent_X");
		return ptr;
	}

};


// Class ProjectX.CanvasTexture_X
// 0x0018 (0x01A8 - 0x0190)
class UCanvasTexture_X : public UTextureRenderTarget2D
{
public:
	struct FScriptDelegate                             __Draw__Delegate;                                         // 0x0190(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0190(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.CanvasTexture_X");
		return ptr;
	}


	void Draw(class UCanvas* C);
};


// Class ProjectX.CanvasTextureComponent_X
// 0x0023 (0x00C0 - 0x009D)
class UCanvasTextureComponent_X : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x3];                                       // 0x009D(0x0003) MISSED OFFSET
	class UMeshComponent*                              Mesh;                                                     // 0x00A0(0x0008) (Edit, Const, ExportObject, Component, EditInline)
	int                                                MaterialIndex;                                            // 0x00A8(0x0004) (Edit, Const)
	struct FName                                       MaterialParamName;                                        // 0x00AC(0x0008) (Edit, Const)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00B4(0x0004) MISSED OFFSET
	class UCanvasTexture_X*                            Texture;                                                  // 0x00B8(0x0008) (Edit, Const, ExportObject, NeedCtorLink, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.CanvasTextureComponent_X");
		return ptr;
	}


	void OnDraw(class UCanvas* C);
};


// Class ProjectX.PlayerController_X
// 0x00A8 (0x0860 - 0x07B8)
class APlayerController_X : public APlayerController
{
public:
	class ACamera*                                     CameraArchetype;                                          // 0x07B8(0x0008) (Edit)
	class AHUD*                                        HUDArchetype;                                             // 0x07C0(0x0008) (Edit)
	class APawn*                                       OldPawnReference;                                         // 0x07C8(0x0008) (Transient)
	class AActor*                                      LockedDebugActor;                                         // 0x07D0(0x0008) (Transient)
	unsigned long                                      bPausedForExternalUI : 1;                                 // 0x07D8(0x0004) (Transient)
	unsigned char                                      UnknownData00[0x4];                                       // 0x07DC(0x0004) MISSED OFFSET
	class UNetConnection*                              NetConnection;                                            // 0x07E0(0x0008) (Transient)
	struct FScriptDelegate                             __EventReceivedPRI__Delegate;                             // 0x07E8(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData01[0x8];                                       // 0x07E8(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventPawnChange__Delegate;                              // 0x0800(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0800(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventReceivedPlayer__Delegate;                          // 0x0818(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData03[0x8];                                       // 0x0818(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventDestroyed__Delegate;                               // 0x0830(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData04[0x8];                                       // 0x0830(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventPlayerCameraChange__Delegate;                      // 0x0848(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData05[0x8];                                       // 0x0848(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.PlayerController_X");
		return ptr;
	}


	void ToggleDebugCamera();
	void DebugCrosshair();
	void DebugKill();
	void DebugKillAllExcept();
	bool GetAutoAimTarget(class AActor** HitActor, struct FVector* HitLoc);
	void __PlayerController_X__ReceivedPlayer_EA9A4B764E3C955390235FABE630C648(class UObject* _);
	void ClientSetSeasonReward(const struct FPlayerSeasonRewardProgress& Reward);
	void ServerUpdateCustomMatchSettings(const struct U_Types_X_FCustomMatchSettings& Settings);
	void ServerSetParty(const struct FUniqueNetId& MemberId, const struct FUniqueNetId& NewPartyID);
	void DisconnectSplitScreenPlayer(class UPlayer* P);
	void ServerDestroy();
	void KickPlayerForReason(const struct FString& Reason, const struct FString& Title);
	void ClientNetLag(float PktLag, float PktVariance, float PktLoss, float PktDup, float PktSpike);
	void ServerNetLag(float PktLag, float PktVariance, float PktLoss, float PktDup, float PktSpike);
	void Pause();
	void RemoveOptionFromLastURL(const struct FString& OptName);
	void PrintDebugInfo(class UDebugDrawer* Drawer);
	void ClearOnlineDelegates();
	void RegisterOnlineDelegates();
	void ClientPlayForceFeedbackWaveform(class UForceFeedbackWaveform* FFWaveform, class AActor* FFWaveformInstigator);
	void ClientCommand(const struct FString& Command);
	void ServerCommand(const struct FString& Command);
	void UnPossess();
	void Possess(class APawn* aPawn);
	void OnPawnChange(class APawn* OldPawn, class APawn* NewPawn);
	void PawnReferenceUpdated();
	void ClientRestart(class APawn* NewPawn);
	void GivePawn(class APawn* NewPawn);
	void InitInputSystem();
	class ACamera* GetCameraArchetype();
	void SpawnPlayerCamera();
	void SetPlayerCamera(class ACamera* NewCamera);
	void AddCheats(bool bForce);
	class UOnlineGameAccount_X* GetOnlineAccount();
	class UOnlinePlayer_X* GetOnlinePlayer();
	void OnReceivedPlayerAndPRI();
	void InitPlayerReplicationInfo();
	void Destroyed();
	void OnExternalUIChanged(bool bIsOpening);
	void SetPaused(bool bPaused);
	void ReceivedPlayer();
	class UOnlineGame_X* STATIC_GetOnlineGame();
	TScriptInterface<class UIOnlineGameHost_X> STATIC_GetOnlineGameHost();
	class UOnlineGameLanServer_X* STATIC_GetOnlineGameLanServer();
	class UOnlineGameDedicatedServer_X* STATIC_GetOnlineGameDedicatedServer();
	void SpawnDefaultHUD();
	void SetPRI(class APlayerReplicationInfo* PRI);
	void ReplicatedEvent(const struct FName& VarName);
	void EventPlayerCameraChange(class APlayerController_X* PC);
	void EventDestroyed(class APlayerController_X* PC);
	void EventReceivedPlayer(class APlayerController_X* PC);
	void EventPawnChange(class APlayerController_X* PC, class APawn* OldPawn, class APawn* NewPawn);
	void EventReceivedPRI(class APlayerController_X* PC);
};


// Class ProjectX.CheatManager_X
// 0x0018 (0x0098 - 0x0080)
class UCheatManager_X : public UCheatManager
{
public:
	struct FScriptDelegate                             __EventDelegateTest__Delegate;                            // 0x0080(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0080(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.CheatManager_X");
		return ptr;
	}


	void HandleImageDownloaded(const struct FOnlineImageDownload& Image);
	void DownloadImage(const struct FString& URL, TArray<struct FString>* ArrayInitializer_98814BCD4414F0B7D8A4618C3551EF8C);
	void RandomSleep(float MinDelay, float MaxDelay, float MinSleep, float MaxSleep);
	void Sleep(float Seconds);
	void LoadKismetLevel(const struct FName& LeveFileName);
	void DrawBulletContacts(float LifeTime);
	void PrintReproPhysics(const struct FString& Command, class AActor* A);
	void ReproPhysics(class AActor* A, float LX, float LY, float LZ, float RX, float RY, float RZ, float RW, float VX, float VY, float VZ, float AX, float AY, float AZ);
	void DisableCCD();
	void SimulateInputKey(const struct FName& KeyName);
	void SetNetServerMaxTickRate(float Rate);
	void ScreenShotDir(const struct FString& Directory);
	void ListVisiblePrimitives();
	void HideVisiblePrimitives(const struct FString& NameMatch, const struct FString& NameIgnore);
	void ToggleReplicateVoiceToSelf();
	void ToggleReplicateVoiceToSender();
	void ShutdownCheatManager();
	void InitCheatManager();
	void EventDelegateTest();
};


// Class ProjectX.CheatObject_X
// 0x0000 (0x0060 - 0x0060)
class UCheatObject_X : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.CheatObject_X");
		return ptr;
	}

};


// Class ProjectX.ColorPalette_X
// 0x0020 (0x0080 - 0x0060)
class UColorPalette_X : public UObject
{
public:
	int                                                DefaultId;                                                // 0x0060(0x0004) (Edit)
	int                                                HueCount;                                                 // 0x0064(0x0004) (Edit, Const, EditConst)
	int                                                ValueCount;                                               // 0x0068(0x0004) (Edit, Const, EditConst)
	unsigned char                                      UnknownData00[0x4];                                       // 0x006C(0x0004) MISSED OFFSET
	TArray<struct FLinearColor>                        Colors;                                                   // 0x0070(0x0010) (Edit, Const, EditConst, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.ColorPalette_X");
		return ptr;
	}


	int IntColorToID(int ColorInt);
	int IdToColorInt(int ColorID);
	struct FColorPosition GetColorPosition(int ColorID);
	struct FLinearColor GetValidColor(const struct FLinearColor& InColor);
	int GetClosestID(const struct FLinearColor& InColor);
	struct FLinearColor GetColor(int ColorID);
};


// Class ProjectX.Compression_X
// 0x0000 (0x0060 - 0x0060)
class UCompression_X : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.Compression_X");
		return ptr;
	}


	bool Uncompress(TArray<unsigned char>* Compressed, TArray<unsigned char>* Uncompressed);
	bool Compress(TArray<unsigned char>* Uncompressed, TArray<unsigned char>* Compressed);
};


// Class ProjectX.ControlPreset_X
// 0x0038 (0x0098 - 0x0060)
class UControlPreset_X : public UObject
{
public:
	TArray<struct FPlayerBinding>                      PCBindings;                                               // 0x0060(0x0010) (Config, NeedCtorLink)
	TArray<struct FPlayerBinding>                      GamepadBindings;                                          // 0x0070(0x0010) (Config, NeedCtorLink)
	unsigned long                                      bRemovedPCOverrides : 1;                                  // 0x0080(0x0004)
	unsigned long                                      bRemovedGamepadOverrides : 1;                             // 0x0080(0x0004)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0084(0x0004) MISSED OFFSET
	TArray<struct FPlayerBinding>                      SteamInputBindings;                                       // 0x0088(0x0010) (Config, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.ControlPreset_X");
		return ptr;
	}


	TArray<struct FPlayerBinding> GetGamepadBindings();
	TArray<struct FPlayerBinding> GetPCBindings();
};


// Class ProjectX.CrashReport_X
// 0x0000 (0x0060 - 0x0060)
class UCrashReport_X : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.CrashReport_X");
		return ptr;
	}


	void HandleHttpRequestComplete(class UHttpRequestInterface* Request, class UHttpResponseInterface* Response, bool bSuccess);
};


// Class ProjectX.CRC_X
// 0x0000 (0x0060 - 0x0060)
class UCRC_X : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.CRC_X");
		return ptr;
	}


	int STATIC_CrcBytes(TArray<unsigned char>* Bytes);
	int STATIC_CrcString(const struct FString& Text);
};


// Class ProjectX.CycleLog_X
// 0x001C (0x008C - 0x0070)
class UCycleLog_X : public UComponent
{
public:
	int                                                MaxLogs;                                                  // 0x0070(0x0004) (Edit)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0074(0x0004) MISSED OFFSET
	TArray<struct FString>                             Logs;                                                     // 0x0078(0x0010) (Transient, NeedCtorLink)
	int                                                LogIndex;                                                 // 0x0088(0x0004) (Const, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.CycleLog_X");
		return ptr;
	}


	void AllLogs(struct FString* S);
};


// Class ProjectX.DistributionFloatShakeParameter_X
// 0x0007 (0x00A8 - 0x00A1)
class UDistributionFloatShakeParameter_X : public UDistributionFloatParameterBase
{
public:
	unsigned char                                      UnknownData00[0x7];                                       // 0x00A1(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.DistributionFloatShakeParameter_X");
		return ptr;
	}

};


// Class ProjectX.EffectsMap_X
// 0x0010 (0x0070 - 0x0060)
class UEffectsMap_X : public UObject
{
public:
	TArray<struct FEffectsMapping>                     Effects;                                                  // 0x0060(0x0010) (Edit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.EffectsMap_X");
		return ptr;
	}


	struct FEffectsMapping GetEffects(class UPhysicalMaterial* PhysMat);
};


// Class ProjectX.EngineShare_X
// 0x0120 (0x0180 - 0x0060)
class UEngineShare_X : public UEngineShare
{
public:
	class UOnlineGame_Base_X*                          OnlineGame;                                               // 0x0060(0x0008) (Transient)
	class ULocalCache_X*                               LocalCache;                                               // 0x0068(0x0008) (Transient)
	struct FString                                     ArchetypeString_OnlineGame;                               // 0x0070(0x0010) (Edit, Const, NeedCtorLink)
	struct FString                                     ArchetypeString_OnlineGameDedicatedServer;                // 0x0080(0x0010) (Edit, Const, NeedCtorLink)
