#pragma once

// Rocket League (1.31) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class TAGame._AITypes_TA
// 0x0000 (0x0060 - 0x0060)
class U_AITypes_TA : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame._AITypes_TA");
		return ptr;
	}

};


// Class TAGame._ShopTypes_TA
// 0x0000 (0x0060 - 0x0060)
class U_ShopTypes_TA : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame._ShopTypes_TA");
		return ptr;
	}

};


// Class TAGame._Types_TA
// 0x0048 (0x00A8 - 0x0060)
class U_Types_TA : public UObject
{
public:
	struct FScriptDelegate                             __AssetLoadedDelegate__Delegate;                          // 0x0060(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0060(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __ProductThumbnailRenderedDelegate__Delegate;             // 0x0078(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0078(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __MapImageLoadedDelegate__Delegate;                       // 0x0090(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0090(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame._Types_TA");
		return ptr;
	}


	int STATIC_GetTotalStatValue(const struct FStatValue& Stat);
	TEnumAsByte<EWordFilterUsage> STATIC_GetChatUsage(TEnumAsByte<EChatChannel> Channel);
	struct FLinearColor STATIC_GammaCorrectColor(const struct FLinearColor& InColor, float Gamma);
	struct FLoadoutTeamPaint STATIC_GetLoadoutPaint(const struct U_Types_TA_FLoadoutData& InLoadoutData);
	int STATIC_GetRandomColorID(class UCarColorSet_TA* Set);
	void STATIC_InitColorSet(class UCarColorSet_TA* Set, TArray<struct FGFxTeamColor>* OutColors);
	struct FString STATIC_ProductQualityToString(TEnumAsByte<EProductQuality> Quality);
	bool STATIC_TeamPaintsAreDifferent(struct U_Types_TA_FLoadoutData* A, struct U_Types_TA_FLoadoutData* B);
	bool STATIC_OnlineProductsAreDifferent();
	bool STATIC_ProductsAreDifferent(TArray<int>* A, TArray<int>* B);
	bool STATIC_LoadoutsAreDifferent(struct U_Types_TA_FLoadoutData* A, struct U_Types_TA_FLoadoutData* B);
	float STATIC_UpdateInputValue(const struct FInputRate& Rate, float DesiredValue, float OldValue, float DeltaTime);
	struct FClientLoadoutData STATIC_ConvertToClientLoadout(struct U_Types_TA_FLoadoutData* FromData);
	void MapImageLoadedDelegate(const struct FMapImageLoadResult& Result);
	void ProductThumbnailRenderedDelegate(const struct FProductThumbnailResult& Result);
	void AssetLoadedDelegate(const struct FAssetLoadResult& Result);
	struct FRandomWeight STATIC_PickWeightedRandom(TArray<struct FRandomWeight> Arr, int* Index);
	bool STATIC_VehicleInputHasChangedForKick(struct FVehicleInputs* NewInput, struct FVehicleInputs* OldInput);
};


// Class TAGame.AIController_TA
// 0x0250 (0x06F0 - 0x04A0)
class AAIController_TA : public AAIController
{
public:
	class ACar_TA*                                     Car;                                                      // 0x04A0(0x0008) (Transient)
	class AVehicle_TA*                                 Vehicle;                                                  // 0x04A8(0x0008) (Transient)
	class UBTComponent*                                BT;                                                       // 0x04B0(0x0008) (Edit, ExportObject, Component, EditInline)
	class UBTProxyType*                                SelfProxyType;                                            // 0x04B8(0x0008) (Edit)
	class UBTProxyType*                                NoneProxyType;                                            // 0x04C0(0x0008) (Edit)
	class UBTProxyType*                                DebugProxyType;                                           // 0x04C8(0x0008) (Edit)
	class UBTProxyType*                                TeamCarsProxyType;                                        // 0x04D0(0x0008) (Edit)
	class UBTProxyType*                                EnemyCarsProxyType;                                       // 0x04D8(0x0008) (Edit)
	class UBTProxyType*                                OtherCarsProxyType;                                       // 0x04E0(0x0008) (Edit)
	class UBTProxyType*                                BoostPillsProxyType;                                      // 0x04E8(0x0008) (Edit)
	class UBTProxyType*                                SelectedProxyType;                                        // 0x04F0(0x0008) (Edit)
	class UBTTarget*                                   SelfTarget;                                               // 0x04F8(0x0008) (Edit)
	class UBTTarget*                                   NoneTarget;                                               // 0x0500(0x0008) (Edit)
	class UBTTarget*                                   IteratorTarget;                                           // 0x0508(0x0008) (Edit)
	class UBTTarget*                                   TeamCarsTarget;                                           // 0x0510(0x0008) (Edit)
	class UBTTarget*                                   SelectedTarget;                                           // 0x0518(0x0008) (Edit)
	class UBTTarget*                                   ContextTarget;                                            // 0x0520(0x0008) (Transient)
	class UBTNode*                                     DebugBTNode;                                              // 0x0528(0x0008) (Edit)
	class UBTLockCollection*                           Locks;                                                    // 0x0530(0x0008) (Edit, ExportObject, Component, EditInline)
	struct FSkillRange                                 SkillSteerError;                                          // 0x0538(0x000C) (Edit)
	struct FSkillRange                                 SkillSteerSpeed;                                          // 0x0544(0x000C) (Edit)
	struct FSkillRange                                 SkillThrottleSpeed;                                       // 0x0550(0x000C) (Edit)
	unsigned char                                      UnknownData00[0x4];                                       // 0x055C(0x0004) MISSED OFFSET
	class AGameEvent_TA*                               GameEvent;                                                // 0x0560(0x0008) (Transient)
	class AAIManager_TA*                               AIManager;                                                // 0x0568(0x0008) (Transient)
	struct FVehicleInputs                              Input;                                                    // 0x0570(0x0020) (Transient)
	struct FVector                                     ForwardDir;                                               // 0x0590(0x000C) (Transient)
	struct FRotator                                    ForwardRotation;                                          // 0x059C(0x000C) (Transient)
	struct FVector                                     GroundNormal;                                             // 0x05A8(0x000C) (Transient)
	unsigned char                                      UnknownData01[0x4];                                       // 0x05B4(0x0004) MISSED OFFSET
	TArray<struct FCachedProxyData>                    CachedProxyDatas;                                         // 0x05B8(0x0010) (Transient, NeedCtorLink)
	TArray<struct FCachedTargetData>                   CachedTargetDatas;                                        // 0x05C8(0x0010) (Transient, NeedCtorLink)
	struct FMap_Mirror                                 TargetFilterMap;                                          // 0x05D8(0x0050) (Native, Transient)
	TArray<class UBTNode*>                             CachedTargetFilters;                                      // 0x0628(0x0010) (Transient, NeedCtorLink)
	struct FVector                                     DebugDriveDestination;                                    // 0x0638(0x000C) (Transient)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0644(0x0004) MISSED OFFSET
	struct FCachedObstaclesData                        CachedObstacles;                                          // 0x0648(0x0028) (Native, Transient)
	TArray<class ACar_TA*>                             TeamCars;                                                 // 0x0670(0x0010) (Transient, NeedCtorLink)
	TArray<class ACar_TA*>                             EnemyCars;                                                // 0x0680(0x0010) (Transient, NeedCtorLink)
	TArray<class ACar_TA*>                             OtherCars;                                                // 0x0690(0x0010) (Transient, NeedCtorLink)
	unsigned long                                      bForceUpdateConditions : 1;                               // 0x06A0(0x0004) (Const, Transient)
	unsigned long                                      bCanUseBoost : 1;                                         // 0x06A0(0x0004) (Transient)
	unsigned long                                      bBeingReplaced : 1;                                       // 0x06A0(0x0004) (Transient)
	unsigned char                                      UnknownData03[0x4];                                       // 0x06A4(0x0004) MISSED OFFSET
	class UGameShare_TA*                               GameShare;                                                // 0x06A8(0x0008) (Transient)
	class AActor*                                      SelectedActor;                                            // 0x06B0(0x0008) (Const, Transient)
	float                                              FieldScalar;                                              // 0x06B8(0x0004) (Transient)
	unsigned char                                      ForcedTeam;                                               // 0x06BC(0x0001)
	unsigned char                                      UnknownData04[0x3];                                       // 0x06BD(0x0003) MISSED OFFSET
	struct FScriptDelegate                             __EventNamedEvent__Delegate;                              // 0x06C0(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData05[0x8];                                       // 0x06BD(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventSkillChanged__Delegate;                            // 0x06D8(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData06[0x8];                                       // 0x06D8(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AIController_TA");
		return ptr;
	}


	void PrintDebugInfo(class UDebugDrawer* Drawer);
	void ActivatePickup();
	void SetSelectedActor(class AActor* NewActor);
	void AllTargets(class UBTTarget* Target, struct FAIProxyData* OutData);
	bool GetObstacleInRadius(const struct FVector& Destination, float Radius, struct FVector* HitLocation);
	bool GetObstacle(const struct FVector& Destination, struct FVector* HitLocation);
	bool GetProxyDataInternal(class UBTProxyType* Type, int Index, struct FAIProxyData* OutData);
	bool GetIndexedProxyData(class UBTProxyType* Type, int Index, struct FAIProxyData* OutData);
	bool GetProxyData(class UBTProxyType* Type, struct FAIProxyData* OutData);
	bool GetIndexedTargetData(class UBTTarget* Target, int Index, struct FAIProxyData* OutData);
	bool GetTargetData(class UBTTarget* Target, struct FAIProxyData* OutData);
	struct FAIProxyData CreateVehicleProxyData(class AVehicle_TA* InVehicle);
	struct FAIProxyData CreateProxyData(class AActor* A, float Radius);
	float GetDriveTime(float Distance);
	float GetDriveDistance(const struct FAIProxyData& Proxy);
	struct FVector FlattenOffset(const struct FVector& Offset, float* Height);
	struct FVector FlattenDestination(const struct FVector& Destination);
	struct FAIProxyData FlattenPhysics(struct FAIProxyData* ProxyData);
	float GetClosestTime2D(float MaxTime, struct FAIProxyData* A, struct FAIProxyData* B);
	bool WillImpact2D(struct FAIProxyData* A, struct FAIProxyData* B, float* CollideTime);
	void AdvancePhysics(float Time, struct FAIProxyData* PhysicsData);
	void PredictPhysics(float Time, float GroundZ, struct FAIProxyData* PhysicsData);
	void PredictLanding(float GroundZ, struct FAIProxyData* Data, float* Time);
	struct FVector AdvanceLocation(float Time, struct FVector* Loc, struct FVector* Vel, struct FVector* Accel);
	void DebugDriveTo(const struct FVector& Destination);
	void DoNothing();
	void AbortBT();
	void Destroyed();
	void OnCarSetup(class ACar_TA* InCar);
	void SetCar();
	void UnPossess();
	void Possess(class APawn* inPawn);
	void SetSkill(float NewSkill, float CanUseBoostThreshold);
	void ReInitBT();
	void HandleOtherCarDestroyed(class APawn_X* InCar);
	void HandleOtherCarDemolished(class ACar_TA* Victim, const struct FDemolishData& Data);
	void HandleOtherCarTeamChanged(class ACar_TA* InCar);
	void HandleCarSpawned(class AGameEvent_TA* InGameEvent, class ACar_TA* InCar);
	void Init(class AGameEvent_TA* InGameEvent);
	void PreBeginPlay();
	void EventSkillChanged(class AAIController_TA* AI);
	void EventNamedEvent(class AAIController_TA* AI, const struct FName& EventName, class AActor* Sender);
};


// Class TAGame.AIController_Soccar_TA
// 0x00B8 (0x07A8 - 0x06F0)
class AAIController_Soccar_TA : public AAIController_TA
{
public:
	class UBTProxyType*                                BallProxyType;                                            // 0x06F0(0x0008) (Edit)
	class UBTProxyType*                                BallLandingProxyType;                                     // 0x06F8(0x0008) (Edit)
	class UBTProxyType*                                BallTeamGoalLineProxyType;                                // 0x0700(0x0008) (Edit)
	class UBTProxyType*                                BallEnemyGoalLineProxyType;                               // 0x0708(0x0008) (Edit)
	class UBTProxyType*                                BallProjectedProxyType;                                   // 0x0710(0x0008) (Edit)
	class UBTProxyType*                                TeamGoalProxyType;                                        // 0x0718(0x0008) (Edit)
	class UBTProxyType*                                EnemyGoalProxyType;                                       // 0x0720(0x0008) (Edit)
	class UBTProxyType*                                MidFieldProxyType;                                        // 0x0728(0x0008) (Edit)
	class UBTTarget*                                   BallTarget;                                               // 0x0730(0x0008) (Edit)
	class UBTTarget*                                   TeamGoalTarget;                                           // 0x0738(0x0008) (Edit)
	class UBTTarget*                                   EnemyGoalTarget;                                          // 0x0740(0x0008) (Edit)
	class AGameEvent_Soccar_TA*                        SoccarGame;                                               // 0x0748(0x0008) (Transient)
	class ABall_TA*                                    Ball;                                                     // 0x0750(0x0008) (Transient)
	struct FAICachedGoalInfo                           TeamGoalInfo;                                             // 0x0758(0x0018) (Transient, Component)
	struct FAICachedGoalInfo                           EnemyGoalInfo;                                            // 0x0770(0x0018) (Transient, Component)
	float                                              LastBallHitTime;                                          // 0x0788(0x0004) (Transient)
	unsigned char                                      UnknownData00[0x4];                                       // 0x078C(0x0004) MISSED OFFSET
	struct FScriptDelegate                             __EventBallChanged__Delegate;                             // 0x0790(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData01[0x8];                                       // 0x078C(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AIController_Soccar_TA");
		return ptr;
	}


	void DisablePickupAutoActivate();
	bool GetProxyDataInternal(class UBTProxyType* Type, int Index, struct FAIProxyData* OutData);
	void GetGoalProxy(class UBTProxyType* Type, const struct FAICachedGoalInfo& GoalInfo, struct FAIProxyData* OutData);
	void GetBallProxy(struct FAIProxyData* OutData);
	void SetBall(class ABall_TA* InBall);
	void HandleNewPickup(class ACar_TA* InCar, class ASpecialPickup_TA* NewPickup);
	void HandleHitBall(class ACar_TA* InCar, class ABall_TA* HitBall, const struct FVector& HitLocation, const struct FVector& HitNormal);
	void OnCarSetup(class ACar_TA* InCar);
	void UpdateBall();
	void HandleActiveRoundChanged(class AGameEvent_Soccar_TA* G);
	void HandleBallsChanged(class AGameEvent_Soccar_TA* G, class ABall_TA* B);
	struct FAICachedGoalInfo GetCachedGoalInfo(int TeamNum);
	void Init(class AGameEvent_TA* InGameEvent);
	void EventBallChanged(class AAIController_Soccar_TA* SoccarAI);
};


// Class TAGame.AIManager_TA
// 0x0040 (0x02A8 - 0x0268)
class AAIManager_TA : public AActor
{
public:
	unsigned long                                      bFlushAILogEachLine : 1;                                  // 0x0268(0x0004) (Edit, Const, Config)
	unsigned long                                      bOutputLogToWindow : 1;                                   // 0x0268(0x0004) (Edit, Const, Config)
	unsigned long                                      bPauseForDirtyTrees : 1;                                  // 0x0268(0x0004) (Transient)
	unsigned char                                      UnknownData00[0x4];                                       // 0x026C(0x0004) MISSED OFFSET
	class UBTLockCollection*                           Locks;                                                    // 0x0270(0x0008) (Edit, Const, ExportObject, Component, EditInline)
	class AGameEvent_TA*                               GameEvent;                                                // 0x0278(0x0008) (Transient)
	TArray<class AAIController_TA*>                    Bots;                                                     // 0x0280(0x0010) (Transient, NeedCtorLink)
	TArray<struct FCachedNavMeshLocation>              CachedNavMeshLocations;                                   // 0x0290(0x0010) (Transient, NeedCtorLink)
	class AFileLog*                                    AILogFile;                                                // 0x02A0(0x0008) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AIManager_TA");
		return ptr;
	}


	void Destroyed();
	void RemoveBot(class AAIController_TA* Bot);
	void AddBot(class AAIController_TA* Bot);
	void Init(class AGameEvent_TA* InGameEvent);
	void AILog(class UObject* Sender, const struct FString& Message, bool bVerbose);
};


// Class TAGame.AnimNodeBlend_TA
// 0x000F (0x0154 - 0x0145)
class UAnimNodeBlend_TA : public UAnimNodeBlendBase
{
public:
	unsigned char                                      UnknownData00[0x3];                                       // 0x0145(0x0003) MISSED OFFSET
	float                                              BlendSpeed;                                               // 0x0148(0x0004) (Edit)
	float                                              Position;                                                 // 0x014C(0x0004) (Transient)
	float                                              DesiredPosition;                                          // 0x0150(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AnimNodeBlend_TA");
		return ptr;
	}

};


// Class TAGame.AnimNodeBlendBoost_TA
// 0x0004 (0x015C - 0x0158)
class UAnimNodeBlendBoost_TA : public UAnimNodeBlend
{
public:
	float                                              BlendTime;                                                // 0x0158(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AnimNodeBlendBoost_TA");
		return ptr;
	}

};


// Class TAGame.AnimNodeBlendSpeed_TA
// 0x000C (0x01B0 - 0x01A4)
class UAnimNodeBlendSpeed_TA : public UAnimNodeAimOffset
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x01A4(0x0004) MISSED OFFSET
	float                                              BlendRate;                                                // 0x01A8(0x0004) (Edit)
	float                                              MaxSpeed;                                                 // 0x01AC(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AnimNodeBlendSpeed_TA");
		return ptr;
	}

};


// Class TAGame.ArenaReflectionsManager_TA
// 0x0064 (0x00C4 - 0x0060)
class UArenaReflectionsManager_TA : public UObject
{
public:
	class AGameEvent_TA*                               SoccarGame;                                               // 0x0060(0x0008)
	TArray<struct FSlapbackActorSetup>                 SlapbackSetups;                                           // 0x0068(0x0010) (Edit, NeedCtorLink)
	TArray<struct FSlapbackActorSetup>                 ArenaReverbSetups;                                        // 0x0078(0x0010) (Edit, NeedCtorLink)
	TArray<class AAkBusActor*>                         SlapBackActors;                                           // 0x0088(0x0010) (NeedCtorLink)
	TArray<class AAkBusActor*>                         ArenaReverbEmitters;                                      // 0x0098(0x0010) (NeedCtorLink)
	struct FName                                       ImpactIntensityKey;                                       // 0x00A8(0x0008)
	struct FName                                       SlapbackDistanceKey;                                      // 0x00B0(0x0008)
	struct FName                                       ReverbBalanceKey;                                         // 0x00B8(0x0008)
	float                                              BallListenerOffset;                                       // 0x00C0(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.ArenaReflectionsManager_TA");
		return ptr;
	}


	struct FVector GetPrimaryPlayerPosition();
	void SetReverbBalance(float ReverbBalance);
	void SetArenaReverbSettings(const struct FName& ArenaReverbShareset);
	void SpawnBusActors(struct FVector* FieldSize);
	float GetSlapbackDistance(struct FVector* ListenerLocation, struct FVector* ImpactLocation, struct FVector* BusActorLocation);
	void UpdateActorParams(float ImpactIntensity, struct FVector* ImpactLocation);
};


// Class TAGame.ArenaSoundSettings_TA
// 0x0100 (0x0160 - 0x0060)
class UArenaSoundSettings_TA : public UObject
{
public:
	class UAkSoundCue*                                 InGameMusicCue;                                           // 0x0060(0x0008) (Edit)
	unsigned long                                      bDynamicMusic : 1;                                        // 0x0068(0x0004) (Edit)
	unsigned long                                      UpdateStatSounds : 1;                                     // 0x0068(0x0004) (Edit)
	unsigned char                                      UnknownData00[0x4];                                       // 0x006C(0x0004) MISSED OFFSET
	class UAkSoundCue*                                 GoalScoreSound;                                           // 0x0070(0x0008) (Edit)
	class UAkSoundCue*                                 GameStartStinger;                                         // 0x0078(0x0008) (Edit)
	class UAkSoundCue*                                 GoalScoreStinger;                                         // 0x0080(0x0008) (Edit)
	class UAkSoundCue*                                 EpicSaveStinger;                                          // 0x0088(0x0008) (Edit)
	class UAkSoundCue*                                 OvertimeStinger;                                          // 0x0090(0x0008) (Edit)
	class UAkSoundCue*                                 WinStinger;                                               // 0x0098(0x0008) (Edit)
	class UAkSoundCue*                                 LoseStinger;                                              // 0x00A0(0x0008) (Edit)
	float                                              GoalScoreStingerDelay;                                    // 0x00A8(0x0004) (Edit)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00AC(0x0004) MISSED OFFSET
	class UAkSoundCue*                                 Win;                                                      // 0x00B0(0x0008) (Edit)
	class UAkSoundCue*                                 Lose;                                                     // 0x00B8(0x0008) (Edit)
	class UAkSoundCue*                                 CountdownStart;                                           // 0x00C0(0x0008) (Edit)
	class UAkSoundCue*                                 CountdownEnd;                                             // 0x00C8(0x0008) (Edit)
	class UAkSoundCue*                                 OneMinRemaining;                                          // 0x00D0(0x0008) (Edit)
	class UAkSoundCue*                                 ThirtySecondsRemaining;                                   // 0x00D8(0x0008) (Edit)
	class UAkSoundCue*                                 OvertimeStart;                                            // 0x00E0(0x0008) (Edit)
	TArray<struct FArenaStatSound>                     StatSounds;                                               // 0x00E8(0x0010) (Edit, EditFixedSize, NeedCtorLink)
	TArray<class UAkSoundCue*>                         CountDownSoundList;                                       // 0x00F8(0x0010) (Edit, NeedCtorLink)
	TArray<class UAkSoundCue*>                         RoundCountDownSoundList;                                  // 0x0108(0x0010) (Edit, NeedCtorLink)
	struct FAkEnvironment                              GoalStingerEnvironment;                                   // 0x0118(0x0020) (Edit, NeedCtorLink)
	struct FAkEnvironment                              LevelDefaultEnvironment;                                  // 0x0138(0x0020) (Edit, NeedCtorLink)
	struct FName                                       ArenaReverbShareset;                                      // 0x0158(0x0008) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.ArenaSoundSettings_TA");
		return ptr;
	}

};


// Class TAGame.AttachmentBehavior_TA
// 0x0014 (0x0074 - 0x0060)
class UAttachmentBehavior_TA : public UObject
{
public:
	class UProductAsset_TA*                            Asset;                                                    // 0x0060(0x0008) (Transient)
	class UActorComponent*                             Component;                                                // 0x0068(0x0008) (ExportObject, Transient, Component, EditInline)
	unsigned long                                      bPreview : 1;                                             // 0x0070(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AttachmentBehavior_TA");
		return ptr;
	}


	class UCarMeshComponent_TA* GetMesh();
	void StopBehavior();
	void SetPreviewing(bool bPreviewing);
	void OnInit();
	void Init(class UProductAsset_TA* InAsset, class UActorComponent* InComponent);
};


// Class TAGame.AttachmentBehavior_Steering_TA
// 0x0044 (0x00B8 - 0x0074)
class UAttachmentBehavior_Steering_TA : public UAttachmentBehavior_TA
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0074(0x0004) MISSED OFFSET
	struct FName                                       BoneControlName;                                          // 0x0078(0x0008) (Edit)
	class UAnimTree*                                   AnimTree;                                                 // 0x0080(0x0008) (Edit)
	struct FInterpCurveFloat                           SteeringToDegreesCurve;                                   // 0x0088(0x0018) (Edit, NeedCtorLink)
	class USkeletalMeshComponent*                      SkelMeshComponent;                                        // 0x00A0(0x0008) (ExportObject, Transient, Component, EditInline)
	class USkelControlSingleBone*                      BoneController;                                           // 0x00A8(0x0008) (Transient)
	class AVehicle_TA*                                 Vehicle;                                                  // 0x00B0(0x0008) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AttachmentBehavior_Steering_TA");
		return ptr;
	}


	void HandleAttached(class UCarMeshComponent_TA* Mesh);
	void OnInit();
};


// Class TAGame.RimSpinner_TA
// 0x0050 (0x00C4 - 0x0074)
class URimSpinner_TA : public UAttachmentBehavior_TA
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0074(0x0004) MISSED OFFSET
	float                                              AccelRate;                                                // 0x0078(0x0004) (Edit)
	float                                              DecelRate;                                                // 0x007C(0x0004) (Edit)
	float                                              MaxSpeed;                                                 // 0x0080(0x0004) (Edit)
	struct FName                                       BoneControlName;                                          // 0x0084(0x0008) (Edit)
	float                                              SpinScale;                                                // 0x008C(0x0004) (Transient)
	int                                                WheelIndex;                                               // 0x0090(0x0004) (Transient)
	float                                              CurrentSpeed;                                             // 0x0094(0x0004) (Transient)
	int                                                CurrentRotation;                                          // 0x0098(0x0004) (Transient)
	unsigned char                                      UnknownData01[0x4];                                       // 0x009C(0x0004) MISSED OFFSET
	class USkeletalMeshComponent*                      SkelMeshComponent;                                        // 0x00A0(0x0008) (ExportObject, Transient, Component, EditInline)
	class USkelControlSingleBone*                      SpinBoneController;                                       // 0x00A8(0x0008) (Transient)
	class USkelControlSingleBone*                      WheelBoneController;                                      // 0x00B0(0x0008) (Transient)
	class UWheel_TA*                                   Wheel;                                                    // 0x00B8(0x0008) (ExportObject, Transient, Component, EditInline)
	unsigned long                                      bIsMainMenu : 1;                                          // 0x00C0(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.RimSpinner_TA");
		return ptr;
	}


	void StopBehavior();
	void HandleAttached(class UCarMeshComponent_TA* Mesh);
	void OnInit();
};


// Class TAGame.WheelShimmy_TA
// 0x0044 (0x00B8 - 0x0074)
class UWheelShimmy_TA : public UAttachmentBehavior_TA
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0074(0x0004) MISSED OFFSET
	float                                              AccumDistance;                                            // 0x0078(0x0004) (Edit)
	float                                              Wave1Freq;                                                // 0x007C(0x0004) (Edit)
	float                                              Wave2Freq;                                                // 0x0080(0x0004) (Edit)
	float                                              OnOffBias;                                                // 0x0084(0x0004) (Edit)
	float                                              HighFreq;                                                 // 0x0088(0x0004) (Edit)
	float                                              ShimmyMag;                                                // 0x008C(0x0004) (Edit, EditInline)
	TArray<int>                                        AffectedWheels;                                           // 0x0090(0x0010) (Edit, NeedCtorLink)
	class USkeletalMeshComponent*                      SkelMeshComponent;                                        // 0x00A0(0x0008) (ExportObject, Transient, Component, EditInline)
	class UWheel_TA*                                   Wheel;                                                    // 0x00A8(0x0008) (ExportObject, Transient, Component, EditInline)
	class USkelControlSingleBone*                      RollControl;                                              // 0x00B0(0x0008) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.WheelShimmy_TA");
		return ptr;
	}


	void OnInit();
};


// Class TAGame.PlayerControllerBase_TA
// 0x00E8 (0x0948 - 0x0860)
class APlayerControllerBase_TA : public APlayerController_X
{
public:
	float                                              SpectatorCameraAccel;                                     // 0x0860(0x0004) (Edit)
	struct FVector                                     SpectatorVelXY;                                           // 0x0864(0x000C) (Transient)
	float                                              SpectatorVelZ;                                            // 0x0870(0x0004) (Transient)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0874(0x0004) MISSED OFFSET
	class UPostProcessManager_TA*                      PostProcessManagerArchetype;                              // 0x0878(0x0008) (Edit)
	class UPostProcessManager_TA*                      PostProcessManager;                                       // 0x0880(0x0008) (Transient)
	int                                                SpectatorPitchDir;                                        // 0x0888(0x0004) (Transient)
	int                                                SwivelPitchDir;                                           // 0x088C(0x0004) (Transient)
	class ASpectatorVolume_TA*                         SpectatorVolume;                                          // 0x0890(0x0008) (Transient)
	float                                              FullRotationScalar;                                       // 0x0898(0x0004) (Const)
	float                                              FullRotationMax;                                          // 0x089C(0x0004) (Const)
	class UVanitySetManager_TA*                        VanityMgr;                                                // 0x08A0(0x0008)
	class UPlayerBanner_TA*                            PlayerBanner;                                             // 0x08A8(0x0008) (ExportObject, Component, EditInline)
	class UPlayerAvatar_TA*                            PlayerAvatar;                                             // 0x08B0(0x0008) (ExportObject, Component, EditInline)
	class UPlayerAvatarBorder_TA*                      PlayerBorder;                                             // 0x08B8(0x0008) (ExportObject, Component, EditInline)
	class UAudioSpectatorMixComponent_TA*              AudioSpectatorMixComponent;                               // 0x08C0(0x0008) (ExportObject, Component, EditInline)
	class UAudioFieldSideComponent_TA*                 AudioFieldSideComponent;                                  // 0x08C8(0x0008) (ExportObject, Component, EditInline)
	struct FScriptDelegate                             __EventLoadingUnfairMatch__Delegate;                      // 0x08D0(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData01[0x8];                                       // 0x08D0(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventRemoveSSPlayer__Delegate;                          // 0x08E8(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData02[0x8];                                       // 0x08E8(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventReceivedCurrencyDrop__Delegate;                    // 0x0900(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData03[0x8];                                       // 0x0900(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __PlayerBanner__ChangeNotify;                             // 0x0918(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData04[0x8];                                       // 0x0918(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __PlayerBorder__ChangeNotify;                             // 0x0930(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData05[0x8];                                       // 0x0930(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.PlayerControllerBase_TA");
		return ptr;
	}


	void ResetView();
	void QueryCrosshair();
	class AAIController_TA* GetLockedDebugAI();
	struct FVector GetAimLocation();
	void ContextualDebugAction();
	void __PlayerBorder__ChangeNotifyFunc();
	void __PlayerBanner__ChangeNotifyFunc();
	struct FVector UpdateSpectatorLocation(const struct FVector& CurrentLocation, float DeltaTime);
	void PrintDebugInfo(class UDebugDrawer* Drawer);
	void ReceiveCurrencyDrop(const struct FCurrency& Drop);
	bool FindSpectatorVolumeLocation(const struct FVector& CurrentLocation, const struct FVector& NextLocation, struct FVector* NewLocation);
	struct FVector ClampSpectatorLocation(const struct FVector& NewLocation);
	void SetWorldSelectionUpdate(bool bAllowUpdate);
	void SetWorldSelectionAllowed(bool bAllowSelection);
	void SetPlayerInput(class UClass* NewInputClass);
	void StartLanMatch(struct U_Types_X_FCustomMatchSettings* Settings);
	struct FString STATIC_BuildMatchOptionsLan(struct U_Types_X_FCustomMatchSettings* Settings, TArray<struct FString>* ArrayInitializer_DDD84EBD4D646B4108E64AB979460CBB);
	void StartSplitscreenMatch(struct U_Types_X_FCustomMatchSettings* Settings, TArray<struct FString>* ArrayInitializer_29D3D6AF4CEA1D6C35C5439F74E9A999);
	void StartMatch(const struct FName& PlaylistName, const struct FString& URL);
	struct FString STATIC_BuildMatchOptions(class UGameSettingPlaylist_X* Playlist, TArray<struct FString> Options, struct U_Types_X_FCustomMatchSettings* Settings, struct FString* ReduceLocal_38717BC4474EF49200DCC3A723B5A5D2);
	struct FString STATIC_JoinOption(const struct FString& FullString, const struct FString& Value);
	struct FName STATIC_GetValidMapName(const struct FName& InName, int GameMode);
	void ClientRemoveSSPlayer(const struct FString& Reason, const struct FString& Title);
	void RemoveSSPlayer(const struct FString& Reason, const struct FString& Title);
	void OnGameInviteAccepted(const struct FString& ErrorString, struct FOnlineGameSearchResult* InviteResult);
	void UpdateSpectatorViewRotation(float DeltaTime);
	struct FRotator GetSpectatorViewRotationDeltaRotation(float DeltaTime);
	void EraseChatByType(TEnumAsByte<EChatChannel> ChatChannel, const struct FUniqueNetId& PersonaId);
	bool PartyLobbyMessage_TA(const struct FUniqueNetId& InSenderId, const struct FString& PlayerName, const struct FString& Message, bool bIsLocalPlayer);
	void Say_TA(const struct FString& Message, TEnumAsByte<EChatChannel> ChatChannel, const struct FUniqueNetId& Recipient, bool bPreset);
	void ServerSay_TA(const struct FString& Message, TEnumAsByte<EChatChannel> ChatChannel, bool bPreset);
	void RepopulateChatHistory(TEnumAsByte<EChatChannel> ChatChannel, const struct FUniqueNetId& PersonaId);
	bool InviteHasEnoughSpace(class UOnlineGameSettings* InviteSettings);
	void HandleReadBorder(TArray<struct FUniqueNetId> PlayerIDs);
	void HandleReadAvatar(TArray<struct FUniqueNetId> PlayerIDs);
	void HandleReadBanner(TArray<struct FUniqueNetId> PlayerIDs);
	void UpdateVanities(TArray<struct FUniqueNetId>* ArrayInitializer_2F97FE2B46EE0CE946679DBE3A1DCEF9);
	void InitVanityUI(class UProfile_TA* Profile, class UGFxShell_X* Shell, TArray<struct FUniqueNetId>* ArrayInitializer_9B25716447A12A02EF3823978DF7C723);
	void InitFromProfile(class UProfile_TA* Profile);
	void HandleLoginStatusChanged(class UOnlinePlayer_X* InPlayer);
	class UObject* GetProfileObject(class UClass* saveClass);
	class UObject* GetSaveObject(class UClass* saveClass);
	void OnExternalUIChanged(bool bIsOpening);
	class USaveData_TA* GetSaveData();
	class UProfile_TA* GetProfile();
	class ULocalPlayer_TA* GetLocalPlayer();
	void UpdateForceFeedback();
	void HandleForceFeedback(class UForceFeedbackManager* _);
	void HandleProfileControlsSave(class UProfileControlsSave_TA* ControlsSave);
	void UpdateAAType();
	void HandlePostProcessManager(class UPostProcessManager_TA* PPM);
	void HandleVideoSettingsSavePC(class UVideoSettingsSavePC_TA* VideoSavePC);
	void UpdateCameraShake();
	void HandleCamera(class ACamera_X* Camera);
	void HandleCameraSave(class UProfileCameraSave_TA* CameraSettings);
	void OnReceivedPlayerAndPRI();
	void Destroyed();
	void ReceivedPlayer();
	void PostBeginPlay();
	void EventReceivedCurrencyDrop(class APlayerControllerBase_TA* PC, const struct FCurrency& Drop);
	void EventRemoveSSPlayer(class APlayerControllerBase_TA* PC, const struct FString& Reason);
	void EventLoadingUnfairMatch(class APlayerControllerBase_TA* PlayerControllerBase);
};


// Class TAGame._TourTypes_TA
// 0x0020 (0x0080 - 0x0060)
class U_TourTypes_TA : public UObject
{
public:
	TArray<struct FName>                               DisabledMutatorCategories;                                // 0x0060(0x0010) (Const, NeedCtorLink)
	TArray<struct FName>                               DisabledMutatorSettings;                                  // 0x0070(0x0010) (Const, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame._TourTypes_TA");
		return ptr;
	}


	TArray<struct FName> STATIC____TourTypes_TA__StripDisabledGameTags_8C0B763C4B9FD86D1F2AFB993E44A546(class UGameSettingCategory_X* GSC, TArray<struct FName>* MapLocal_11DC88F14EA9D34E96AFD09D67F40F1F);
	struct FName STATIC____TourTypes_TA__StripDisabledGameTags_3116DF214E9F6A8685DD47B1A0174819(class UGameSetting_X* GS);
	bool STATIC____TourTypes_TA__StripDisabledGameTags_15A3DB604E0D0FE95E1C68A29462EDAA(class UGameSettingCategory_X* GSC);
	struct FName STATIC____TourTypes_TA__StripDisabledGameTags_5F5DE7614C6AA5E08586A6B28BEAEA5E(const struct FString& SettingName);
	struct FString STATIC_StripDisabledGameTags(const struct FString& GameTags, TArray<class UGameSettingCategory_X*>* GameSettingCategories, TArray<struct FString>* ArrayResultLocal_AC6C609F4A6038FA68A9C68898C7AD85, TArray<struct FName>* MapLocal_B291770A4D6E1A1ACFD0C888442CAD63, TArray<class UGameSettingCategory_X*>* FilterLocal_C1991551412680062F270284381CFB1A, TArray<struct FName>* MapManyLocal_5E30D56E4CDC2EA5CF39EFB260A4B561, TArray<struct FName>* ConcatLocal_3B4048A0421BB548DA1E80A45D747F7E, TArray<struct FName>* DifferenceLocal_E846F34F4C411092F0EE3E823ACC787D);
};


// Class TAGame.PlayerController_TA
// 0x02E0 (0x0C28 - 0x0948)
class APlayerController_TA : public APlayerControllerBase_TA
{
public:
	class ACar_TA*                                     Car;                                                      // 0x0948(0x0008) (Transient)
	class APRI_TA*                                     PRI;                                                      // 0x0950(0x0008) (Transient)
	struct FVehicleInputs                              VehicleInput;                                             // 0x0958(0x0020) (Transient)
	unsigned long                                      bReceivedServerShutdownMessage : 1;                       // 0x0978(0x0004) (Transient)
	unsigned long                                      bUseDebugInputs : 1;                                      // 0x0978(0x0004)
	unsigned long                                      bJumpPressed : 1;                                         // 0x0978(0x0004)
	unsigned long                                      bBoostPressed : 1;                                        // 0x0978(0x0004)
	unsigned long                                      bHandbrakePressed : 1;                                    // 0x0978(0x0004)
	unsigned long                                      bHasPitchedBack : 1;                                      // 0x0978(0x0004)
	unsigned long                                      bAllowAsymmetricalMute : 1;                               // 0x0978(0x0004) (Config)
	unsigned long                                      bResetCamera : 1;                                         // 0x0978(0x0004) (Transient)
	unsigned char                                      UnknownData00[0x4];                                       // 0x097C(0x0004) MISSED OFFSET
	struct FString                                     LoginURL;                                                 // 0x0980(0x0010) (Transient, NeedCtorLink)
	TEnumAsByte<EVoiceFilter>                          VoiceFilter;                                              // 0x0990(0x0001) (Transient)
	TEnumAsByte<EVoiceFilter>                          ChatFilter;                                               // 0x0991(0x0001) (Transient)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0992(0x0002) MISSED OFFSET
	struct FChatSpamData                               ChatSpam;                                                 // 0x0994(0x0018) (Edit)
	struct FChatSpamData                               ChatSpamHarsh;                                            // 0x09AC(0x0018)
	unsigned char                                      UnknownData02[0x4];                                       // 0x09C4(0x0004) MISSED OFFSET
	class ULightBarComponent_TA*                       LightBar;                                                 // 0x09C8(0x0008) (ExportObject, Component, EditInline)
	class UGameMusicComponent_TA*                      MusicComponent;                                           // 0x09D0(0x0008) (ExportObject, Component, EditInline)
	class UAudioPriorityComponent_TA*                  AudioPriorityComponent;                                   // 0x09D8(0x0008) (ExportObject, Component, EditInline)
	class UAudioMixStateComponent_TA*                  AudioMixStateComponent;                                   // 0x09E0(0x0008) (ExportObject, Component, EditInline)
	class APRI_TA*                                     FollowTarget;                                             // 0x09E8(0x0008) (Transient)
	class ACamera*                                     SpectatorCameraArchetype;                                 // 0x09F0(0x0008) (Edit)
	class AHUD*                                        SpectatorHUDArchetype;                                    // 0x09F8(0x0008) (Edit)
	class UClass*                                      SpectatorInputClass;                                      // 0x0A00(0x0008) (Edit)
	class ACamera*                                     EditorCameraArchetype;                                    // 0x0A08(0x0008) (Edit)
	class AHUD*                                        EditorHUDArchetype;                                       // 0x0A10(0x0008) (Edit)
	class UClass*                                      EditorInputClass;                                         // 0x0A18(0x0008) (Edit)
	TScriptInterface<class UInterface_GameEditor_TA>   MoveActor;                                                // 0x0A20(0x0010)
	struct FVector                                     MoveActorGrabOffset;                                      // 0x0A30(0x000C)
	float                                              MoveActorGrabIncrement;                                   // 0x0A3C(0x0004)
	float                                              MinMoveActorGrabDistance;                                 // 0x0A40(0x0004)
	float                                              MouseIncrementSpeed;                                      // 0x0A44(0x0004)
	float                                              BallVelocityIncrementAmount;                              // 0x0A48(0x0004)
	int                                                BallVelocityIncrementFireCount;                           // 0x0A4C(0x0004)
	float                                              BallVelocityIncrementFireCountMax;                        // 0x0A50(0x0004)
	float                                              BallVelocityIncrementSpeedDefault;                        // 0x0A54(0x0004)
	float                                              BallVelocityIncrementSpeedMax;                            // 0x0A58(0x0004)
	float                                              CrosshairTraceDistance;                                   // 0x0A5C(0x0004)
	class AActor*                                      TracedCrosshairActor;                                     // 0x0A60(0x0008)
	TArray<struct FCrosshairExtentInfo>                CrosshairTraceExtents;                                    // 0x0A68(0x0010) (NeedCtorLink)
	TScriptInterface<class UInterface_GameEditor_TA>   RotatedActor;                                             // 0x0A78(0x0010)
	struct FVector                                     RotateActorCameraLocationOffset;                          // 0x0A88(0x000C)
	struct FVector                                     RotateActorCameraRotationOffset;                          // 0x0A94(0x000C)
	int                                                RotateActorCameraSide;                                    // 0x0AA0(0x0004)
	float                                              DesiredCameraSide;                                        // 0x0AA4(0x0004)
	float                                              PawnTypeChangedTime;                                      // 0x0AA8(0x0004)
	int                                                SelectedSpawnArchetype;                                   // 0x0AAC(0x0004)
	struct FVehicleInputs                              DebugInputs;                                              // 0x0AB0(0x0020) (Transient)
	int                                                MinClientInputRate;                                       // 0x0AD0(0x0004) (Edit, Config)
	int                                                MedianClientInputRate;                                    // 0x0AD4(0x0004) (Edit, Config)
	int                                                MaxClientInputRate;                                       // 0x0AD8(0x0004) (Edit, Config)
	int                                                ConfiguredClientInputRate;                                // 0x0ADC(0x0004) (Edit, Config)
	float                                              TimeSinceLastMovePacket;                                  // 0x0AE0(0x0004) (Transient)
	float                                              TimeLastReplicatedMovePacket;                             // 0x0AE4(0x0004) (Transient)
	class UPlatformMetrics_TA*                         PlatformMetrics;                                          // 0x0AE8(0x0008) (ExportObject, Transient, Component, EditInline)
	float                                              MouseXDeadZone;                                           // 0x0AF0(0x0004)
	float                                              MouseYDeadZone;                                           // 0x0AF4(0x0004)
	float                                              MouseXDeadZoneAir;                                        // 0x0AF8(0x0004)
	float                                              MouseYDeadZoneAir;                                        // 0x0AFC(0x0004)
	struct FVehicleInputs                              LastInputs;                                               // 0x0B00(0x0020)
	class APRI_TA*                                     PendingViewPRI;                                           // 0x0B20(0x0008) (Transient)
	class UClientConnectionTracker_TA*                 ConnectionTracker;                                        // 0x0B28(0x0008) (ExportObject, Transient, Component, EditInline)
	class UProfileCameraSave_TA*                       CameraSave;                                               // 0x0B30(0x0008) (Transient)
	float                                              LastInputPitchUp;                                         // 0x0B38(0x0004) (Transient)
	float                                              LastInputPitchDown;                                       // 0x0B3C(0x0004) (Transient)
	float                                              LastInputYawLeft;                                         // 0x0B40(0x0004) (Transient)
	float                                              LastInputYawRight;                                        // 0x0B44(0x0004) (Transient)
	float                                              LastInputPitch;                                           // 0x0B48(0x0004) (Transient)
	float                                              LastInputYaw;                                             // 0x0B4C(0x0004) (Transient)
	float                                              MouseInputMax;                                            // 0x0B50(0x0004) (Const)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0B54(0x0004) MISSED OFFSET
	class AControllerEventInfo_TA*                     ControllerEventInfoArchetype;                             // 0x0B58(0x0008) (Edit)
	class AControllerEventInfo_TA*                     ControllerEventInfo;                                      // 0x0B60(0x0008) (Edit)
	class UEngineShare_TA*                             EngineShare;                                              // 0x0B68(0x0008)
	class UProfileAimAssistSave_TA*                    AimAssistSave;                                            // 0x0B70(0x0008)
	class ANetworkInputBuffer_TA*                      InputBuffer;                                              // 0x0B78(0x0008) (Net)
	struct FScriptDelegate                             __EventLaunchAccountPicker__Delegate;                     // 0x0B80(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData04[0x8];                                       // 0x0B80(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventLaunchControllerApplet__Delegate;                  // 0x0B98(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData05[0x8];                                       // 0x0B98(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventMuteChanged__Delegate;                             // 0x0BB0(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData06[0x8];                                       // 0x0BB0(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventTrainingEditorActorModified__Delegate;             // 0x0BC8(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData07[0x8];                                       // 0x0BC8(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventSelectBallCamTarget__Delegate;                     // 0x0BE0(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData08[0x8];                                       // 0x0BE0(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventConnectionTrackerAttached__Delegate;               // 0x0BF8(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData09[0x8];                                       // 0x0BF8(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventChatMessage__Delegate;                             // 0x0C10(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData10[0x8];                                       // 0x0C10(0x0008) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.PlayerController_TA");
		return ptr;
	}


	void HandleCarSet(class APRI_TA* InPRI);
	void SpawnSelectedArchetype();
	bool RemoveActor();
	void ToggleGrabActor();
	void ToggleRotateActor();
	void EditorReleaseActor();
	void EditorCycleActor();
	void DuplicateShot();
	void StopEditing();
	void EditorIncreasePower();
	void EditorDecreasePower();
	void EditorIncreasePowerToggleInterim();
	void EditorDecreasePowerToggleInterim();
	void EditorIncreasePowerToggle(bool bToggle);
	void EditorDecreasePowerToggle(bool bToggle);
	void ModifyEditorPower(int Direction);
	void ToggleCameraPosition();
	void EditorUndo();
	void EditorRedo();
	void EditorIncreaseRoundTime();
	void EditorDecreaseRoundTime();
	void EditorNextRound();
	void EditorPrevRound();
	void UpdateCrosshair();
	void __PlayerController_TA__PostBeginPlay_7FB7747C47621114303C76804365394D(class UObject* Obj);
	void __PlayerController_TA__ReceivedPlayer_FA690C414AA39B414E8B67831AF26F3B(class UBanSync_TA* BanSync);
	int __PlayerController_TA__ClientNotifyServerShutdown_EB9A97B344CEB1A3E97B83B7A6D9EA22(class ATeam_Soccar_TA* T);
	void NetClientInputRate(int Rate);
	void ClientStayAsPartyVoteBegin();
	void ServerUpdateCustomMatchSettings(const struct U_Types_X_FCustomMatchSettings& Settings);
	void ClientUpdateTournamentMatch(const struct FTourMatch& Match, int GameNum, const struct FTourMatchGame& GameData);
	void ServerCreateMatchBroadcast(class AGameEvent_Soccar_TA* GameEvent);
	void ClampMoveActorGrabOffset();
	void RevertToDefaultCameraHUDInput();
	void SetCameraHUDInput(class ACamera* InCameraArchetype, class AHUD* InHUDArchetype, class UClass* InPlayerInputClass);
	void SwitchToEditPawn();
